{
  "timestamp": 1756024066379,
  "total": 50,
  "data": [
    {
      "id": 6211,
      "malid": "59192",
      "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle",
      "type": "Movie",
      "episodes": 3,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.78,
      "poster": "https://i.animepahe.ru/uploads/posters/08f262e7aa63e9e31708e190780793aa0b8c5193ab80bab4eeaf046679773350.jpg",
      "synopsis": "Anime movie trilogy adaptation of the Infinity Castle Arc.",
      "session": "b45d57c5-32f8-2eed-4440-319137d71e9a",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:17.114Z",
      "source": "animepahe"
    },
    {
      "id": 4,
      "malid": "21",
      "title": "One Piece",
      "type": "TV",
      "episodes": null,
      "status": "Currently Airing",
      "season": "Fall",
      "year": 1999,
      "score": 8.73,
      "poster": "https://i.animepahe.ru/posters/14fdc4bb11b03ddd1e803582730fea4ab4782e7974ccf54e558dd50cd207f639.jpg",
      "synopsis": "Barely surviving in a barrel after passing through a terrible whirlpool at sea, carefree Monkey D. Luffy ends up aboard a ship under attack by fearsome pirates. Despite being a naive-looking teenager, he is not to be underestimated. Unmatched in battle, Luffy is a pirate himself who resolutely pursues the coveted One Piece treasure and the King of the Pirates title that comes with it.\n\nThe late King of the Pirates, Gol D. Roger, stirred up the world before his death by disclosing the whereabouts of his hoard of riches and daring everyone to obtain it. Ever since then, countless powerful pirates have sailed dangerous seas for the prized One Piece only to never return. Although Luffy lacks a crew and a proper ship, he is endowed with a superhuman ability and an unbreakable spirit that make him not only a formidable adversary but also an inspiration to many.\n\nAs he faces numerous challenges with a big smile on his face, Luffy gathers one-of-a-kind companions to join him in his ambitious endeavor, together embracing perils and wonders on their once-in-a-lifetime adventure.\n\n[Written by MAL Rewrite]",
      "session": "d58fc9f8-582e-fdf0-3618-112cd54ed5ab",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:17.379Z",
      "source": "animepahe"
    },
    {
      "id": 6234,
      "malid": "59845",
      "title": "The Fragrant Flower Blooms with Dignity",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.72,
      "poster": "https://i.animepahe.ru/uploads/posters/7103371364ff1310373c89cf444ffc3e6de0b757694a0936ae80e65cfae400b5.jpg",
      "synopsis": "Despite being adjacent to one another, Chidori Public High School and the all-girls Kikyo Private Academy seem to exist in two different worlds. While the latter boasts an immaculate reputation and favors students from wealthy backgrounds, the former is a nest for dim-witted delinquents. Everyone at Kikyo harbors a deep hatred for their Chidori neighbors.\n\nSixteen-year-old Rintarou Tsumugi is a student at Chidori whose intimidating face leads people to avoid him. Rintarou pays no mind to this, as he is content with his group of friends. However, there is something he has not told them yet: sometimes, he helps out at his family's cake shop.\n\nOne day at work, Rintarou sees a customer at a table, but she runs off before he can talk to her. The next day, he receives an apology from the girl, Kaoruko Waguri, who explains that she did not run away because of his appearance and that she believes Rintarou is a kind-hearted person. Although he is not used to Kaoruko's bright personality, Rintarou looks forward to forming a friendship with her. There is just one obstacle that stands in his way: Kaoruko is a Kikyo student!\n\n[Written by MAL Rewrite]",
      "session": "27a95751-0311-47ed-dbce-7f0680d5074a",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:17.855Z",
      "source": "animepahe"
    },
    {
      "id": 5754,
      "malid": "59986",
      "title": "Grand Blue Dreaming Season 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.68,
      "poster": "https://i.animepahe.ru/uploads/posters/2ba818b000b34c721d4aacd12f3950b2110c04bb6269710c7709df6459af4d23.jpg",
      "synopsis": "Second season of Grand Blue.",
      "session": "785d08ac-4a7a-6c64-ae6d-f2bce029d355",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:18.334Z",
      "source": "animepahe"
    },
    {
      "id": 5905,
      "malid": "60543",
      "title": "Dan Da Dan Season 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.53,
      "poster": "https://i.animepahe.ru/uploads/posters/013e790868af51b843b24b391a01cffe38b03167d45292b62e780abc27490761.jpg",
      "synopsis": "Second season of Dandadan.",
      "session": "eb60c032-081f-2049-f869-babd395f242e",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:18.811Z",
      "source": "animepahe"
    },
    {
      "id": 6086,
      "malid": "53447",
      "title": "To Be Hero X",
      "type": "ONA",
      "episodes": 24,
      "status": "Currently Airing",
      "season": "Spring",
      "year": 2025,
      "score": 8.44,
      "poster": "https://i.animepahe.ru/posters/c361cd57aede81b2e767e05aa9aadd2e28e25b2511a07bece93b5ebcd7c0c1eb.jpg",
      "synopsis": "This is a world where heroes are created by people's trust, and the hero who has received the most trust is known as \"X.\" In this world, people's trust can be calculated by data, and these values will be reflected on everyone's wrist. As long as enough trust points are obtained, ordinary people can also have superpowers and become superheroes that save the world. However, the ever-changing trust value makes the hero's path full of unknowns...\n\n(Source: Bilibili, translated)",
      "session": "1d6b96ff-45c4-c842-1a91-45af89eb8474",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:19.777Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "51039",
      "title": "Doupo Cangqiong: Nian Fan",
      "type": "ONA",
      "episodes": 209,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.44,
      "poster": "https://cdn.myanimelist.net/images/anime/1419/126374l.webp",
      "synopsis": "Fifth season of Doupo Cangqiong.",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:20.791Z",
      "source": "jikan"
    },
    {
      "id": 4137,
      "malid": "60988",
      "title": "Heaven Official's Blessing",
      "type": "ONA",
      "episodes": 11,
      "status": "Finished Airing",
      "season": "Fall",
      "year": 2020,
      "score": 8.41,
      "poster": "https://i.animepahe.ru/posters/0e87348272c71f47959abf384c677509478017562efe299d10a65bfa953d4600.jpg",
      "synopsis": "A short film celebrating the fourth anniversary of the donghua's releases, highlighting Hua Cheng's and Xie Lian's first encounter.",
      "session": "0218bf10-ac26-2f29-f4e3-e12232dc8b8f",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:19.299Z",
      "source": "animepahe"
    },
    {
      "id": 6231,
      "malid": "53065",
      "title": "My Dress-Up Darling Season 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.38,
      "poster": "https://i.animepahe.ru/uploads/posters/542f5b616e395cf08a23f020481d79d1302977ed30d689d51e63f90097dc264f.jpg",
      "synopsis": "After Marin Kitagawa introduced Wakana Gojou to the world of cosplay, he has been creating her outfits with ease. Even so, he still has a lot to learn, and every new lesson seems to strengthen his love for sewing and for the hina dolls his grandfather taught him to make.\n\nMeanwhile, Kitagawa finds it harder and harder to hide her feelings for Gojou. Friends and strangers alike constantly mistake them for a couple, much to Gojou's embarrassment. After all, in his eyes, their worlds are far too different for anyone to think they could be romantically linked. However, as Gojou spends more time with Kitagawa and realizes that his passions are not ridiculed by other people, a relationship between the two no longer seems so far-fetched.\n\n[Written by MAL Rewrite]",
      "session": "809db533-7820-44f9-f859-a195f7cc462e",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:21.273Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "55809",
      "title": "Xian Ni",
      "type": "ONA",
      "episodes": 128,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.37,
      "poster": "https://cdn.myanimelist.net/images/anime/1289/149708l.webp",
      "synopsis": "Wang Lin is a very smart boy with loving parents. Although he and his parents are shunned by the rest of their relatives, his parents have always held high hopes that he will one day achieve greatness. One day, Wang Lin suddenly gained the chance to walk the path of an immortal but found that he only had mediocre talent at best. Watch Wang Lin as he breaks through his lack of talent and walks the path towards becoming a real immortal!\n\n(Source: Xian Ni Wiki)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:22.072Z",
      "source": "jikan"
    },
    {
      "id": 4889,
      "malid": "50250",
      "title": "Chiikawa",
      "type": "TV",
      "episodes": null,
      "status": "Currently Airing",
      "season": "Spring",
      "year": 2022,
      "score": 8.34,
      "poster": "https://i.animepahe.ru/posters/6f626841e4f29cd0608efab5a90b6da350ecba7b1483247cdf252783cc2dbe86.jpg",
      "synopsis": "What's a Chiikawa? No one really knows, but everyone can see they're small, they're cute, and they're always having a fun time! Join them as they explore their surreal world with the sharp humor and clever antics that make the Chiikawa irresistible.\n\n(Source: HIDIVE, edited)",
      "session": "ec8c87fc-9f05-b110-4bbc-27b0da1365de",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:22.821Z",
      "source": "animepahe"
    },
    {
      "id": 6236,
      "malid": "57433",
      "title": "Rascal Does Not Dream of Santa Claus",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.28,
      "poster": "https://i.animepahe.ru/uploads/posters/5292461088881a448d6baa39e9f663d70e1679b1e3445802d75a22d1efc0aade.jpg",
      "synopsis": "After surviving the entrance exams, Sakuta Azusagawa has finally enrolled in the same university as his girlfriend, Mai Sakurajima. He is gradually getting used to the unfamiliar environment as he attends student gatherings and makes new acquaintances. Everything seems to be going smoothly until Sakuta's friend and Sweet Bullet idol group member Uzuki Hirokawa begins acting out.\n\nWith fellow Sweet Bullet member Nodoka Toyohama pleading for his help, Sakuta realizes that he has stumbled upon another case of the inexplicable Puberty Syndrome—Uzuki is feeling pressured by the sudden surge of popularity and rumors of a potential solo career. While Sakuta searches for a solution, another occurrence of Puberty Syndrome gradually emerges from the shadows.\n\n[Written by MAL Rewrite]",
      "session": "025b8411-f3ff-809b-4bf9-751552950caa",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:23.303Z",
      "source": "animepahe"
    },
    {
      "id": 6233,
      "malid": "58390",
      "title": "Call of the Night Season 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.26,
      "poster": "https://i.animepahe.ru/uploads/posters/1fddabd5dae2bba47c020577ea4df5139cea47a6d0c3bedaff648578f94f4f1f.jpg",
      "synopsis": "Second season of Yofukashi no Uta.",
      "session": "bd82c9e0-73b3-0d9e-8078-a8e01cddaa78",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:23.782Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "47794",
      "title": "MILGЯAM",
      "type": "Music",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.22,
      "poster": "https://cdn.myanimelist.net/images/anime/1497/112023l.webp",
      "synopsis": "Es awakens in the facility Milgram to find a strange talking animal named Jackalope staring them down. Soon, they learn their purpose: as the prison guard, Es must delve into the psyches of 10 inmates, each of them imprisoned for causing the loss of life in some form or another. Their fates rest in Es' hands. Do the means justify an end, and how much does intent matter if the result is death? No matter how the lines between good and evil, right and wrong, and just and cruel are blurred, there are only two options Es can choose between: innocent or guilty.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:24.390Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "52684",
      "title": "Shen Yin Wangzuo 2nd Season",
      "type": "ONA",
      "episodes": 182,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.22,
      "poster": "https://cdn.myanimelist.net/images/anime/1897/150028l.webp",
      "synopsis": "Revealing himself to be a Dual Knight, Long Hao Chen triumphs in his match within his temple and advances to the finals. But before the grand finals can begin, ranking matches are conducted in each temple to determine the strongest within. During the rankings, Hao Chen is injured, enraging Sheng Cai'er and driving her to seek vengeance for what happened to him. Her actions cause a fight between the Knight Temple and Assassin Temple, only to be subdued after a shocking revelation—that Sheng Cai'er is a Reincarnated Saint.\n\nThe finals for the Demon Hunting Team Competition begin with the division of the sixty remaining participants into six groups. The top sixteen participants are then further pitted against each other to determine the top three. Each of the top three will be rewarded with a spiritual stove and the right to pick their teammates.\n\nIn order to become a knight that is capable of defeating the Demon Lord, Long Hao Chen must strive to be first in this competition so he can select the best teammates to give him a fighting chance.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:25.191Z",
      "source": "jikan"
    },
    {
      "id": 6239,
      "malid": "61322",
      "title": "Dr. Stone: Science Future Part 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.21,
      "poster": "https://i.animepahe.ru/uploads/posters/6846c63e00f8947c5647b800a34da5747225b2ae41c8a513d9d5ccb0d3b8b7d1.jpg",
      "synopsis": "Part two of Dr. Stone: Science Future.",
      "session": "af297b6f-ee2b-abd2-16ca-18e7b32f5406",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:25.456Z",
      "source": "animepahe"
    },
    {
      "id": 3,
      "malid": "235",
      "title": "Meitantei Conan",
      "type": "TV",
      "episodes": null,
      "status": "Currently Airing",
      "season": "Winter",
      "year": 1996,
      "score": 8.18,
      "poster": "https://i.animepahe.ru/uploads/posters/cfda6c1cfc8d46d111ab54e039d5685499fd5bc3612c8ba0829cf7f47c524bc9.jpg",
      "synopsis": "Shinichi Kudou, a high school student of astounding talent in detective work, is well known for having solved several challenging cases. One day, when Shinichi spots two suspicious men and decides to follow them, he inadvertently becomes witness to a disturbing illegal activity. Unfortunately, he is caught in the act, so the men dose him with an experimental drug formulated by their criminal organization, leaving him to his death. However, to his own astonishment, Shinichi lives to see another day, but now in the body of a seven-year-old child.\n\nPerfectly preserving his original intelligence, he hides his real identity from everyone, including his childhood friend Ran Mouri and her father, private detective Kogorou Mouri. To this end, he takes on the alias of Conan Edogawa, inspired by the mystery writers Arthur Conan Doyle and Ranpo Edogawa.\n\nShinichi, as Conan, starts secretly solving the senior Mouri's cases from behind the scenes with his still exceptional sleuthing skills, while covertly investigating the organization responsible for his current state, hoping to reverse the drug's effects someday.\n\n[Written by MAL Rewrite]",
      "session": "f4fd317a-6233-a018-8b6e-e632bf750bdb",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:25.719Z",
      "source": "animepahe"
    },
    {
      "id": 6240,
      "malid": "58913",
      "title": "The Summer Hikaru Died",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.16,
      "poster": "https://i.animepahe.ru/uploads/posters/30cbcfecd028da1c9aeb2934ea6d81c568d461261c82494020bab06919439cba.jpg",
      "synopsis": "It has been six months since Yoshiki Tsujinaka's best friend, Hikaru Indou, went missing in the mountains and returned a week later with no recollection of what had transpired. Certain that it is not the Hikaru he knows who came back, Yoshiki finally asks Hikaru about it. Suddenly, \"Hikaru\" reveals his true monstrous form and begs Yoshiki to keep it a secret, as he does not want to kill him.\n\nDespite his paranormal nature, \"Hikaru\" seems almost innocent, full of childlike wonder and eager to experience the summer heat, the countryside, and all kinds of other things in a human body for the first time. And for Yoshiki, it matters little if \"Hikaru\" is a fake relying on stolen memories—as long as he never leaves again. As Yoshiki desperately clings to \"Hikaru\" in his intense grief, it becomes increasingly clear that something dangerous and supernatural may have descended from the mountains into their village.\n\n[Written by MAL Rewrite]",
      "session": "05da70df-dd24-0a25-0115-e8448a85abfe",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:26.200Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "44042",
      "title": "Holo no Graffiti",
      "type": "ONA",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.15,
      "poster": "https://cdn.myanimelist.net/images/anime/1259/110227l.webp",
      "synopsis": "From unraveling the secrets of opening and closing doors to defusing surprise packages more commonly known as bombs, there is never a dull day at the Hololive Production office! Holo no Graffiti follows an eccentric cast of Virtual YouTubers, also known as \"VTubers,\" going about their absurd yet hilarious daily lives, detailing all their cute moments and mishaps.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:27.329Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "60557",
      "title": "Fanren Xiu Xian Chuan: Waihai Fengyun",
      "type": "ONA",
      "episodes": 52,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.14,
      "poster": "https://cdn.myanimelist.net/images/anime/1388/149196l.webp",
      "synopsis": "Fourth season of Fanren Xiu Xian Chuan.",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:28.459Z",
      "source": "jikan"
    },
    {
      "id": 6243,
      "malid": "52293",
      "title": "New Panty & Stocking with Garterbelt",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.08,
      "poster": "https://i.animepahe.ru/uploads/posters/48bac0ef735ad9dfba971bad8c5043491c0d7dc1ce3118ebf1a61e7c083fbfed.jpg",
      "synopsis": "New season of Panty &amp; Stocking with Garterbelt.",
      "session": "72b5b3de-335b-95f9-4733-c2b4a917eb17",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:28.725Z",
      "source": "animepahe"
    },
    {
      "id": 4461,
      "malid": "56524",
      "title": "Swallowed Star",
      "type": "ONA",
      "episodes": 26,
      "status": "Finished Airing",
      "season": "Fall",
      "year": 2020,
      "score": 8.06,
      "poster": "https://i.animepahe.ru/posters/793266c269f13c147ff09ea74f8c89b224351d1eb251c1c71c7300b7095e8020.jpg",
      "synopsis": "Fourth season of Tunshi Xingkong.",
      "session": "19c70d20-20c2-b51d-3e82-1aba330ecf44",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:22.556Z",
      "source": "animepahe"
    },
    {
      "id": 6238,
      "malid": "59062",
      "title": "Gachiakuta",
      "type": "TV",
      "episodes": 24,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.05,
      "poster": "https://i.animepahe.ru/uploads/posters/66e945f94d0c115f5227d6fffd571618b7fe4022aec0c75fb9809daa59a49845.jpg",
      "synopsis": "Living in the slums of a wealthy town, Rudo and his foster father Regto try to coexist with the rest of the town's residents, but Rudo despises the wastefulness of the upper class. Ignoring the warnings from those around him, Rudo regularly rummages through the town's garbage in search of anything useful or valuable to save from the \"Abyss\"—a massive hole where anything considered trash is dumped, including people. Rudo's biological father was one such person, having been thrown into the Abyss after he was accused of murder.\n\nOne day, after running into a mysterious figure on the way home, Rudo returns to find Regto's dying body on the floor. He is immediately found at the scene by the authorities and is charged with murder. No one believes his claims of innocence, and he is thrown into the Abyss. Instead of dying, however, he finds himself in a strange, foul-smelling place surrounded by monsters made out of trash.\n\nWhen Rudo is attacked by said monsters, he is saved by a man named Enjin, who reveals himself to be a \"Cleaner\"—someone who uses special weapons called Vital Instruments to combat these creatures. In order to get his revenge on the one who killed Regto, Rudo reluctantly becomes a Cleaner to fight his way back up and out of the Abyss.\n\n[Written by MAL Rewrite]",
      "session": "42dd67ed-699c-d2d4-194a-3f2365652272",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:28.989Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "51836",
      "title": "Douluo Dalu II: Jueshi Tangmen",
      "type": "ONA",
      "episodes": 156,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.03,
      "poster": "https://cdn.myanimelist.net/images/anime/1985/150594l.webp",
      "synopsis": "A strange continent in another world.\n\nNo magic, no battle qi, no martial arts, only martial spirits. Ten thousand years after the Tang clan was founded on the Douluo continent, the Tang clan has declined to the verge of extinction.\n\nA whole new generation of proud talents has been born. Will the new generation of the Seven monsters of Shrek be able to reestablish the Tang Clan and compose a new tale of greatness for the unrivaled Tang Clan?\n\n(Source: IMDB)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:31.035Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "59953",
      "title": "Mushen Ji",
      "type": "ONA",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 8.03,
      "poster": "https://cdn.myanimelist.net/images/anime/1324/150012l.webp",
      "synopsis": "In the Disabled Elderly Village, there live nine elderly people with unpredictable origins and the young man Qin Mu they raised. One day, the cows that Qin Mu was responsible for grazing began to speak human words. From then on, Qin Mu became more aware of the dangers and beauty of Daxu, a land abandoned by gods: demons descended with darkness, divine bones danced in the ruins, and dragon bones protected their young, a giant ship that drags the sun... No matter what kind of danger he faces, Qin Mu is fearless. He has integrated the skills passed down by the Nine Elders and vowed to carve out a world with his unparalleled hegemony. \n\n(Source: Bilibili, Google translated)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:32.780Z",
      "source": "jikan"
    },
    {
      "id": 6246,
      "malid": "59459",
      "title": "Secrets of the Silent Witch",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 8.02,
      "poster": "https://i.animepahe.ru/uploads/posters/cfaa0fdf489e658030bbecfa9630227af0c484d415e1bf7ba8cc270ed1ccc156.jpg",
      "synopsis": "Monica Everett, the Silent Witch, is the only mage in the world who can use unchanted magecraft, a true hero who singlehandedly defeated a legendary black dragon. However, this young genius is actually...super-duper shy! That's right: She learned to cast spells silently just to avoid speaking in public, and despite her power, she has zero self-confidence. Now Monica has been tasked with secretly guarding the second prince. Can she keep it together as she faces both the evil forces targeting the prince and the terrors of social interaction?\n\n(Source: Yen Press)",
      "session": "58ddb495-f827-3dcf-955b-f4fc4a73607c",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:29.469Z",
      "source": "animepahe"
    },
    {
      "id": 6252,
      "malid": "61339",
      "title": "Toilet-Bound Hanako-kun Season 2 Part 2",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.97,
      "poster": "https://i.animepahe.ru/uploads/posters/65dc9ed70cbc3622a547b4a41389e69560ddb266d255328fac71a859b77341ce.jpg",
      "synopsis": "Due to frequent misadventures with the supernatural and her hectic school life, Nene Yashiro can barely catch a break until Kamome Academy's annual sleepover event comes around. Nene is excited to blow off some steam with her best friend Aoi Akane and the rest of her class at the get-together. Unbeknownst to her, the sleepover falls on the same date as Urabon, when the line between the dead and the living gets distorted, allowing wicked spirits to come out to the surface.\n\nWhen an evil ghost is about to attack her, Nene is rescued by a mysterious figure: Shinigami, the Sixth Wonder that can trap souls using his flute. In that moment, Shinigami takes notice of Aoi and abducts her to use her as a sacrifice that will close the barrier for good. Joined by Hanako-kun and Akane Aoi, Nene must embark on a journey into the deepest confines of the world of the dead to save her best friend before it is too late.\n\n[Written by MAL Rewrite]",
      "session": "9be2c61b-755e-f83b-2161-9fb083330396",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:33.263Z",
      "source": "animepahe"
    },
    {
      "id": 6237,
      "malid": "60285",
      "title": "Sakamoto Days Part 2",
      "type": "TV",
      "episodes": 11,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.92,
      "poster": "https://i.animepahe.ru/uploads/posters/ae2d24374a736db79de1d4caeaf7c1a01b5bc97c9657d87b2263ffefa7bdd4a4.jpg",
      "synopsis": "Second part of Sakamoto Days.",
      "session": "a86c0265-d763-fdb8-ccc6-b5555b241cd6",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:33.527Z",
      "source": "animepahe"
    },
    {
      "id": 6232,
      "malid": "59177",
      "title": "Kaiju No. 8 Season 2",
      "type": "TV",
      "episodes": 11,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.91,
      "poster": "https://i.animepahe.ru/uploads/posters/5dd9f83e31c3c5e0f3b75db4acf90c9f0da27ec2205e0aa786190225c9110f67.jpg",
      "synopsis": "Second season of Kaijuu 8-gou.",
      "session": "e7f9b554-0f0d-3dbd-e8b1-ae226206aa67",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:34.090Z",
      "source": "animepahe"
    },
    {
      "id": 6248,
      "malid": "59898",
      "title": "City The Animation",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.9,
      "poster": "https://i.animepahe.ru/uploads/posters/9c15d1451f14437f5a342de151b758805e72e566d55bf542991f971d128d3fe9.jpg",
      "synopsis": "This town, is not just a normal town. There's laughter, love and emotional moments. An unpredictable ordinary life presented by the residents! Exciting stuffs come one after another. Welcome to CITY.\n\n(Source: Prime Video)",
      "session": "d957867d-d470-7ce7-72fc-4c23095fafc1",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:34.357Z",
      "source": "animepahe"
    },
    {
      "id": 6262,
      "malid": "59205",
      "title": "Clevatess",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.88,
      "poster": "https://i.animepahe.ru/uploads/posters/b03b8f353643d4f5b5f511bc2c7b0fc9d21e1d9b6f7e59bd35f8580aa0225073.jpg",
      "synopsis": "Alicia, who had dreamed of becoming a hero since childhood, is chosen by the king as one of the thirteen heroes. Armed with a legendary sword, the heroes set out to defeat the Demon King Clevatess. However, their recklessness triggers a terrible crisis that could wipe out all of humanity on the continent of Edsea. Now, the world's only hope lies with a baby entrusted to the Demon King.\n\n(Source: Official site, translated)",
      "session": "79fe94dc-8a14-630c-2760-13ed564ef809",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:34.624Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "47405",
      "title": "Wanmei Shijie",
      "type": "ONA",
      "episodes": 234,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.84,
      "poster": "https://cdn.myanimelist.net/images/anime/1619/137928l.webp",
      "synopsis": "Born into a unique world where villages fight to gain power and control, the main character, Shi Hao, is a genius blessed by the heavens born under the poorest of conditions.\n\nHis clan, however, has a mysterious past. To rise up and become the genius he is meant to be, the clan goes through every effort to aid his cultivation as they battle through fanatical monsters and engage in power struggles with other clans.\n\nHis journey will bring him through unknown lands until he is able to become a person that can truly shake the world.\n\n(Source: Novels Xianxia&amp;Xuanhuan Wiki)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:35.321Z",
      "source": "jikan"
    },
    {
      "id": 787,
      "malid": "966",
      "title": "Crayon Shin-chan",
      "type": "TV",
      "episodes": null,
      "status": "Currently Airing",
      "season": "Spring",
      "year": 1992,
      "score": 7.81,
      "poster": "https://i.animepahe.ru/posters/6ee149fc970d0e798572fcb796bca1298f3f750ec2cefaf08918b7f9fe0d9aa5.jpg",
      "synopsis": "There is no such thing as an uneventful day in the life of kindergartener Shinnosuke \"Shin-chan\" Nohara. The five-year-old is a cut above the most troublesome, perverted, and shameless kid one can imagine. Shin-chan is almost always engaged in questionable activities such as forgetting about a friend during hide and seek, sumo wrestling for love, performing various gags including the notorious \"elephant\" in public, and flirting with college girls. The exemplary troublemaker has done it all and has no plans to stop anytime soon.\n\nCrayon Shin-chan follows the daily shenanigans of Shin-chan with his group of friends, parading around as the self-proclaimed \"Kasukabe Defense Force.\" The adults witnessing these shenanigans unfold can't help but adore Shin-chan, as he keeps them entertained while unintentionally solving their daily troubles through his mindless antics—leaving himself as the only problem they do not know what to do with.\n\n[Written by MAL Rewrite]",
      "session": "8a53e333-74b8-9fb6-721e-9b82085e83e6",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:35.586Z",
      "source": "animepahe"
    },
    {
      "id": 6098,
      "malid": "60334",
      "title": "Anne Shirley",
      "type": "TV",
      "episodes": 24,
      "status": "Currently Airing",
      "season": "Spring",
      "year": 2025,
      "score": 7.77,
      "poster": "https://i.animepahe.ru/posters/1275504f1f8d7b6308bd33f15643cd66577fc787f8451ecfd2ddfc060912e878.jpg",
      "synopsis": "Eleven-year-old orphan Anne Shirley has spent her life moving from one family to another, always hoping to find a place where she truly belongs. When she is sent to live with elderly siblings Marilla and Matthew Cuthbert at Green Gables, a quiet farm in the town of Avonlea, it is quickly revealed that she is there by mistake. Having expected a boy able to help out with farm work, the Cuthberts are surprised to instead receive a young girl with a vivid imagination and a flair for the dramatic.\n\nDespite the Cuthberts' initial hesitation, Anne's energy, intelligence, and charm soon win them over. Anne settles into her new life, experiencing many things for the first time—such as attending school and making close friends—as she learns to navigate the joys and challenges of growing up.\n\n[Written by MAL Rewrite]",
      "session": "6fc5d299-a2eb-4a88-40ed-6a08b8bb1dc3",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:35.850Z",
      "source": "animepahe"
    },
    {
      "id": 6260,
      "malid": "59791",
      "title": "Ruri Rocks",
      "type": "TV",
      "episodes": 13,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.73,
      "poster": "https://i.animepahe.ru/uploads/posters/b5b466ddf7bed56b798aac72c496efa3aace4d9ae44cf2245815018dcc7a5365.jpg",
      "synopsis": "The story of Ruri, a girl who likes jewelry and accessories, diving into the world of mineralogy.",
      "session": "0b10585b-1cde-b888-ecda-5e12c5392a34",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:36.562Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "8687",
      "title": "Doraemon (2005)",
      "type": "TV",
      "episodes": null,
      "status": "Currently Airing",
      "season": "spring",
      "year": 2005,
      "score": 7.72,
      "poster": "https://cdn.myanimelist.net/images/anime/6/23935l.webp",
      "synopsis": "Doraemon (2005) is the most recent anime series based on Fujiko Fujio's manga of the same name. \n\nIt is the 2005 version of 1979 series, with certain changes in the animation and other things.\n\nDoraemon is a cat-like robot who appears in the present to steer Nobita/Noby, who is a dumb, naive and clumsy boy on the right path in order to secure his future. Nobita's love interest is Shizuka Minamoto/Sue, his frenemies are Takeshi Goda/Big G and Suneo/Sneech.\n\n(Source: Wikipedia)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:37.140Z",
      "source": "jikan"
    },
    {
      "id": 6255,
      "malid": "58749",
      "title": "Arknights: Rise from Ember",
      "type": "TV",
      "episodes": 10,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.69,
      "poster": "https://i.animepahe.ru/uploads/posters/e217173d94c8b12c8023424c2e98dc594dfb5eb220c2cf07cd82739f18cebe86.jpg",
      "synopsis": "\"She\" was supposed to be a beacon of hope. But now her anger and hatred have turned into flames of war and are about to engulf the people.\n\nOnly Rhodes Island, a neutral organization, can stop Reunion's rampage and the conspiracy behind it. Amiya and the others head towards Chernobog's Core City, which is on a collision course with Lungmen. What fate awaits them there...\n\n(Source: Official Site, translated)",
      "session": "0151d702-ff81-a3d6-00b8-89e63ebc6ca6",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:37.400Z",
      "source": "animepahe"
    },
    {
      "id": 6280,
      "malid": "60131",
      "title": "Let's Go Karaoke!",
      "type": "TV",
      "episodes": 5,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.65,
      "poster": "https://i.animepahe.ru/uploads/posters/710a1a8d78113d85101ff9bf7f858b468ce99b31ebfdc0ff9c94e92f4ef5e5ae.jpg",
      "synopsis": "Nothing worries Satomi Oka more than the upcoming final choir competition of his middle school career—right up until he is accosted by a stranger from the shadows who demands, \"Let's go karaoke!\" As a yakuza, Kyouji Narita doesn't scare easily, but a terrifying prospect has driven him to seek Satomi's help. The boss is holding a karaoke contest, with the loser forced to get a tattoo to be selected and torturously applied by the boss himself! Oka has been to many vocal rehearsals over the years, but never one-on-one karaoke sessions with a gangster!!\n\n(Source: Yen Press)",
      "session": "4c1087fc-9f3d-318c-10b7-b2c1aeed41f0",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:37.876Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "51289",
      "title": "Zhe Tian",
      "type": "ONA",
      "episodes": 156,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.64,
      "poster": "https://cdn.myanimelist.net/images/anime/1162/135727l.webp",
      "synopsis": "In the far reaches of the dark and frozen universe, nine enormous dragon corpses were tied with an ancient bronze coffin. It seems that they were set there since the birth of the universe. Such an astonishing scene was captured by a space probe floating in outer space.\n\nNine dragons and the mysterious bronze coffin made people wonder whether they came back to ancient times or just reached the other shore of the universe. A giant mythical world was unfolded, where immortality gradually appeared and paranormal events continuously occurred.\n\nCountless people started to find their own tracks (The Dao) in such a mythical realm. Their passion was like a turbulent ocean wave that would never cease. The heat in their blood was like erupting volcanoes. Their desire for power and immortality dragged them down to the chasm without knowing it.\n\nThirty-three classmates held a reunion after graduating. Their friendship was tested, as the bronze coffin took them away from earth and arrived on another unknown planet. The desire for living forced them to follow the path of the ancient gods. Entering a new world of cultivation, will any of them reach immortality, or will they all die along the way?",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:39.510Z",
      "source": "jikan"
    },
    {
      "id": 6256,
      "malid": "59207",
      "title": "Dealing with Mikadono Sisters Is a Breeze",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.63,
      "poster": "https://i.animepahe.ru/uploads/posters/15d8d35e156069198533a4e0791551cc9c3426dcb8beda79f4fd9651985892d5.jpg",
      "synopsis": "As the son of the late legendary actress Subaru Ayase, Yuu has had many expectations placed upon him after he transferred to Saika Academy, a highly prestigious school where students can hone their personal talents. However, in contrast to his mother, Yuu is completely talentless. Being seen as completely mediocre, he would have no chance of standing side by side with the three emperors of Saika Academy: the Mikadono sisters, Miwa, Nico, and Kazuki, who are each prodigies in shogi, martial arts, and performing arts, respectively.\n\nWith Subaru's friend agreeing to take her son in, Yuu aims to fulfill his mother's last wish to him, which is to build a happy family, after never being able to form a proper mother-son relationship due to their difference in talent. As it turns out, his mother's friend is actually the father of the Mikadono sisters! Keeping his mother's wish in mind, Yuu aims to build familial bonds with the siblings. However, due to their extreme focus on their respective specializations, they show little interest in opening themselves up not only to him, but to each other as well. Nonetheless, Yuu strives to continuously support the three prodigies, as his kindness and care restores the bond between the sisters.\n\n[Written by MAL Rewrite]",
      "session": "37f2f2a8-d2c2-a821-6de0-0d479c4aca20",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:38.823Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "59328",
      "title": "Incha Couple ga You Gal-tachi to Sex Training Suru Hanashi",
      "type": "OVA",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.58,
      "poster": "https://cdn.myanimelist.net/images/anime/1315/150094l.webp",
      "synopsis": "Unstoppable gals get out of control! The sex life of an otaku student couple develops rapidly due to the influence of gal schoolgirls.\n\n(Source: TMDB)",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:40.351Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "49944",
      "title": "Shishunki no Obenkyou",
      "type": "OVA",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.57,
      "poster": "https://cdn.myanimelist.net/images/anime/1195/149968l.webp",
      "synopsis": null,
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:40.929Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "59662",
      "title": "Long Zu II: Daowangzhe Zhi Tong",
      "type": "ONA",
      "episodes": 24,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.56,
      "poster": "https://cdn.myanimelist.net/images/anime/1577/147273l.webp",
      "synopsis": "Second season of Long Zu (Dragon Raja).",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:42.784Z",
      "source": "jikan"
    },
    {
      "id": 6250,
      "malid": "60326",
      "title": "There's No Freaking Way I'll be Your Lover! Unless...",
      "type": "TV",
      "episodes": 12,
      "status": "Currently Airing",
      "season": "Summer",
      "year": 2025,
      "score": 7.55,
      "poster": "https://i.animepahe.ru/uploads/posters/ea35ea1eec722f931ad593a16461f7b7cd302f9a12ffbda076ec7acabc8f8adb.jpg",
      "synopsis": "Renako Amaori is leaving her awkward and lonely junior high school life behind, determined to become a normal girl with normal friends in high school. Glamorous, confident Mai Ouzuka is Renako's total opposite: wealthy, outgoing, and a literal fashion model. Against the odds, the two girls form an immediate connection. Renako thinks she may have found the best friend of her dreams...until Mai's romantic confession sends her into a tailspin. Renako wants to prove to Mai that being BFFs is better than being girlfriends, but Mai is dead set on convincing Renako that they're destined to be lovers. Let the love games begin!\n\n(Source: Seven Seas Entertainment)",
      "session": "1abdeb23-fe28-dc61-7169-e3d5946718b0",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:43.262Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "41409",
      "title": "Wushen Zhuzai",
      "type": "ONA",
      "episodes": 608,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.53,
      "poster": "https://cdn.myanimelist.net/images/anime/1738/107609l.webp",
      "synopsis": "The protagonist Qin Chen, who was originally the top genius in the military domain, was conspired by the people to fall into the death canyon in the forbidden land of the mainland. Qin Chen, who was inevitably dead, unexpectedly triggered the power of the mysterious ancient sword.\n\nThree hundred years later, in a remote part of the Tianwu mainland, a boy of the same name accidentally inherited Qin Chen’s will. As the beloved grandson of King Dingwu of the Daqi National Army, due to the birth father’s birth, the mother and son were treated coldly in Dingwu’s palace and lived together. In order to rewrite the myth of the strong man in hope of the sun, and to protect everything he loves, Qin Chen resolutely took up the responsibility of maintaining the five kingdoms of the world and set foot on the road of martial arts again.",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:44.491Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "59407",
      "title": "Iribitari Gal ni Ma〇ko Tsukawasete Morau Hanashi",
      "type": "ONA",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.51,
      "poster": "https://cdn.myanimelist.net/images/anime/1049/150095l.webp",
      "synopsis": null,
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:45.184Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "48824",
      "title": "Blue Archive PVs",
      "type": "PV",
      "episodes": null,
      "status": "Currently Airing",
      "season": null,
      "year": null,
      "score": 7.46,
      "poster": "https://cdn.myanimelist.net/images/anime/1521/114598l.webp",
      "synopsis": "Animated promotions for the mobile game Blue Archive.",
      "session": null,
      "slug": null,
      "scanned_at": "2025-08-24T08:27:45.761Z",
      "source": "jikan"
    },
    {
      "id": 5523,
      "malid": "59095",
      "title": "I Was Reincarnated as the 7th Prince so I Can Take My Time Perfecting My Magical Ability",
      "type": "TV",
      "episodes": 12,
      "status": "Finished Airing",
      "season": "Spring",
      "year": 2024,
      "score": 7.42,
      "poster": "https://i.animepahe.ru/posters/d80b35e15b72ecb2f3ea15b1322cc486c8356540c12bc1260a328e40aa0c5c30.jpg",
      "synopsis": "Second season of Tensei shitara Dainana Ouji Datta node, Kimama ni Majutsu wo Kiwamemasu.",
      "session": "869285a6-cdf7-e160-c5cc-2a3897a7c227",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:38.350Z",
      "source": "animepahe"
    },
    {
      "id": 4775,
      "malid": "58892",
      "title": "Bubble",
      "type": "ONA",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Spring",
      "year": 2022,
      "score": 7.24,
      "poster": "https://i.animepahe.ru/posters/1f146a766bea193e1d27e16c84d8c448959b20258b92624b0835c0e52703b9fb.jpg",
      "synopsis": null,
      "session": "c07748e3-0e36-ba67-64b6-40dc46ea0cf0",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:46.028Z",
      "source": "animepahe"
    },
    {
      "id": 3391,
      "malid": "36064",
      "title": "Fate/Grand Order: Absolute Demonic Front - Babylonia Initium Iter",
      "type": "Special",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 2019,
      "score": 7.13,
      "poster": "https://i.animepahe.ru/posters/3718059d22275e25cfcff9f1da6f97928f305686e6bdf90b73e75824a530a8c6.jpg",
      "synopsis": "Assorted commercials and collaborations for the Fate/Grand Order mobile RPG. These short animations are posted to Type-Moon's official YouTube channel and advertise the game itself or promote a new game event (eg. Dead Heat Summer Race! for summer 2017). The animation is unique to these commercials and is not present in the mobile game nor in the TV special of Fate/Grand Order.",
      "session": "ce0c7ce7-9b63-96f3-0d7f-573edab20065",
      "slug": null,
      "scanned_at": "2025-08-24T08:27:39.773Z",
      "source": "animepahe"
    }
  ]
}