{
  "timestamp": 1765850525080,
  "total": 75,
  "data": [
    {
      "id": null,
      "malid": "57555",
      "title": "Chainsaw Man Movie: Reze-hen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 9.16,
      "poster": "https://cdn.myanimelist.net/images/anime/1763/150638l.webp",
      "synopsis": "Sequel to Chainsaw Man.",
      "session": null,
      "slug": null,
      "duration": "1 hr 39 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 2,
      "popularity": 901,
      "favorites": 8552,
      "scored_by": 156404,
      "scanned_at": "2025-12-16T02:00:55.000Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "39486",
      "title": "Gintama: The Final",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 9.05,
      "poster": "https://cdn.myanimelist.net/images/anime/1245/116760l.webp",
      "synopsis": "Two years have passed following the Tendoshuu's invasion of the O-Edo Central Terminal. Since then, the Yorozuya have gone their separate ways. Foreseeing Utsuro's return, Gintoki Sakata begins surveying Earth's ley lines for traces of the other man's Altana. After an encounter with the remnants of the Tendoshuu—who continue to press on in search of immortality—Gintoki returns to Edo.\n\nLater, the regrouped Shinsengumi and Yorozuya begin an attack on the occupied Central Terminal. With the Altana harvested by the wreckage of the Tendoshuu's ship in danger of detonating, the Yorozuya and their allies fight their enemies while the safety of Edo—and the rest of the world—hangs in the balance. Fulfilling the wishes of their teacher, Shouyou Yoshida's former students unite and relive their pasts one final time in an attempt to save their futures.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 44 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 7,
      "popularity": 1512,
      "favorites": 4592,
      "scored_by": 83977,
      "scanned_at": "2025-12-16T02:00:55.761Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "28851",
      "title": "Koe no Katachi",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.93,
      "poster": "https://cdn.myanimelist.net/images/anime/1122/96435l.webp",
      "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n \n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 10 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 20,
      "popularity": 19,
      "favorites": 94435,
      "scored_by": 1756064,
      "scanned_at": "2025-12-16T02:00:56.722Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "15335",
      "title": "Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.89,
      "poster": "https://cdn.myanimelist.net/images/anime/10/51723l.webp",
      "synopsis": "When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 50 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 24,
      "popularity": 1059,
      "favorites": 2151,
      "scored_by": 143064,
      "scanned_at": "2025-12-16T02:00:58.101Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "37987",
      "title": "Violet Evergarden Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.84,
      "poster": "https://cdn.myanimelist.net/images/anime/1825/110716l.webp",
      "synopsis": "Several years have passed since the end of The Great War. As the radio tower in Leidenschaftlich continues to be built, telephones will soon become more relevant, leading to a decline in demand for \"Auto Memory Dolls.\" Even so, Violet Evergarden continues to rise in fame after her constant success with writing letters. However, sometimes the one thing you long for is the one thing that does not appear.\n\nViolet Evergarden Movie follows Violet as she continues to comprehend the concept of emotion and the meaning of love. At the same time, she pursues a glimmer of hope that the man who once told her, \"I love you,\" may still be alive even after the many years that have passed.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 20 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 32,
      "popularity": 328,
      "favorites": 9555,
      "scored_by": 327297,
      "scanned_at": "2025-12-16T02:00:59.066Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "59571",
      "title": "Shingeki no Kyojin Movie: Kanketsu-hen - The Last Attack",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.83,
      "poster": "https://cdn.myanimelist.net/images/anime/1379/145452l.webp",
      "synopsis": "A compilation movie for Shingeki no Kyojin: The Final Season - Kanketsu-hen.",
      "session": null,
      "slug": null,
      "duration": "2 hr 24 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 33,
      "popularity": 2897,
      "favorites": 517,
      "scored_by": 29559,
      "scanned_at": "2025-12-16T02:01:00.030Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "32281",
      "title": "Kimi no Na wa.",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.83,
      "poster": "https://cdn.myanimelist.net/images/anime/5/87048l.webp",
      "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.\n\nOne day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.\n\nKimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 46 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 34,
      "popularity": 11,
      "favorites": 94564,
      "scored_by": 2043751,
      "scanned_at": "2025-12-16T02:01:00.788Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "31758",
      "title": "Kizumonogatari III: Reiketsu-hen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.78,
      "poster": "https://cdn.myanimelist.net/images/anime/1084/112813l.webp",
      "synopsis": "After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. \n\nAraragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her.\n\nBut there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place?\n\nAraragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret…\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 22 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 40,
      "popularity": 499,
      "favorites": 8052,
      "scored_by": 292745,
      "scanned_at": "2025-12-16T02:01:01.751Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "199",
      "title": "Sen to Chihiro no Kamikakushi",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.77,
      "poster": "https://cdn.myanimelist.net/images/anime/6/79597l.webp",
      "synopsis": "Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way.\n\nVivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 4 min",
      "rating": "PG - Children",
      "rank": 42,
      "popularity": 44,
      "favorites": 34738,
      "scored_by": 1389704,
      "scanned_at": "2025-12-16T02:01:02.724Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "52198",
      "title": "Kaguya-sama wa Kokurasetai: First Kiss wa Owaranai",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.72,
      "poster": "https://cdn.myanimelist.net/images/anime/1670/130060l.webp",
      "synopsis": "After their first kiss, Kaguya Shinomiya and Miyuki Shirogane are left unsure where their relationship stands. The troubling uncertainty of whether they could be considered an official couple unleashes newfound problems as both Kaguya and Shirogane struggle to sort out their feelings.\n\nWhile the lovestruck student council officers fret, the Christmas season rolls around, and romance is in the air. In the face of widespread tenderness, Kaguya and Shirogane must endure their affectionate battle of wits once more. Should they reconcile their feelings for one another, they may find themselves within reach of what they have both been longing for so long: true love.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 36 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 54,
      "popularity": 752,
      "favorites": 2267,
      "scored_by": 199237,
      "scanned_at": "2025-12-16T02:01:03.485Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "45649",
      "title": "The First Slam Dunk",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.71,
      "poster": "https://cdn.myanimelist.net/images/anime/1745/129284l.webp",
      "synopsis": "Shohoku's \"speedster\" and point guard, Ryouta Miyagi, always plays with brains and lightning speed, running circles around his opponents while feigning composure. Born and raised in Okinawa, Ryouta had a brother who was three years older. Following in the footsteps of his older brother, who was a famous local player from a young age, Ryouta also became addicted to basketball.\n\nIn his second year of high school, Ryouta plays with the Shohoku High School basketball team along with Sakuragi, Rukawa, Akagi, and Mitsui as they take the stage at the Inter-High School National Championship. And now, they are on the brink of challenging the reigning champions, Sannoh Kogyo High School.\n\n(Source: GKIDS, edited)",
      "session": null,
      "slug": null,
      "duration": "2 hr 4 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 60,
      "popularity": 2850,
      "favorites": 1017,
      "scored_by": 33553,
      "scanned_at": "2025-12-16T02:01:04.046Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "59192",
      "title": "Kimetsu no Yaiba Movie 1: Mugenjou-hen - Akaza Sairai",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.7,
      "poster": "https://cdn.myanimelist.net/images/anime/1681/148216l.webp",
      "synopsis": "First anime movie of the trilogy adaptation of the Infinity Castle Arc.",
      "session": null,
      "slug": null,
      "duration": "2 hr 35 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 68,
      "popularity": 914,
      "favorites": 3037,
      "scored_by": 128504,
      "scanned_at": "2025-12-16T02:01:04.805Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "431",
      "title": "Howl no Ugoku Shiro",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.67,
      "poster": "https://cdn.myanimelist.net/images/anime/1470/138723l.webp",
      "synopsis": "That jumbled piece of architecture, that cacophony of hissing steam and creaking joints, with smoke billowing from it as it moves on its own... That castle is home to the magnificent wizard Howl, infamous for both his magical prowess and for being a womanizer—or so the rumor goes in Sophie Hatter's small town. Sophie, as the plain daughter of a hatmaker, does not expect much from her future and is content with working hard in the shop. \n\nHowever, Sophie's simple life takes a turn for the exciting when she is ensnared in a disturbing situation, and the mysterious wizard appears to rescue her. Unfortunately, this encounter, brief as it may be, spurs the vain and vengeful Witch of the Waste—in a fit of jealousy caused by a past discord with Howl—to put a curse on the maiden, turning her into an old woman.\n\nIn an endeavor to return to normal, Sophie must accompany Howl and a myriad of eccentric companions—ranging from a powerful fire demon to a hopping scarecrow—in his living castle, on a dangerous adventure as a raging war tears their kingdom apart.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 59 min",
      "rating": "G - All Ages",
      "rank": 76,
      "popularity": 99,
      "favorites": 31291,
      "scored_by": 1006438,
      "scanned_at": "2025-12-16T02:01:05.563Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "164",
      "title": "Mononoke Hime",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.67,
      "poster": "https://cdn.myanimelist.net/images/anime/1355/147277l.webp",
      "synopsis": "When an Emishi village is attacked by a fierce demon boar, the young prince Ashitaka puts his life at stake to defend his tribe. With its dying breath, the beast curses the prince's arm, granting him demonic powers while gradually siphoning his life away. Instructed by the village elders to travel westward for a cure, Ashitaka arrives at Tatara, the Iron Town, where he finds himself embroiled in a fierce conflict: Lady Eboshi of Tatara, promoting constant deforestation, stands against Princess San and the sacred spirits of the forest, who are furious at the destruction brought by the humans. As the opposing forces of nature and mankind begin to clash in a desperate struggle for survival, Ashitaka attempts to seek harmony between the two, all the while battling the latent demon inside of him. Princess Mononoke is a tale depicting the connection of technology and nature, while showing the path to harmony that could be achieved by mutual acceptance.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 13 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 77,
      "popularity": 106,
      "favorites": 23831,
      "scored_by": 873116,
      "scanned_at": "2025-12-16T02:01:06.526Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "57647",
      "title": "Uma Musume: Pretty Derby - Shin Jidai no Tobira",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.64,
      "poster": "https://cdn.myanimelist.net/images/anime/1427/142210l.webp",
      "synopsis": "Jungle Pocket, a.k.a. Pokke, is a Umamusume girl who has been running free in freestyle races, aiming to be the strongest. On a whim, Pokke watches a race in the Twinkle Series. She is shocked by Fuji Kiseki's performance in the race, and decides to challenge for the Twinkle Series herself.\n\nPokke enters \"Toresen Academy,\" where Umamusume girls gather, and under the guidance of trainer Tanabe, who raised Fuji Kiseki, she takes on the \"Classic Triple Crown Race,\" a race she is allowed to attempt only once in her lifetime. What awaited him there were rivals of the same generation who were even more talented than Pokke.\n\nDedicated to her work, Dantsu Flame continues to work hard and honestly. Manhattan Cafe, running after a \"friend\" that only she can see. And Agnes Tachyon, a mad scientist who seeks beyond the possibilities of Uma Musume.\n\nThese Umamusume girls put their pride, their will, and their souls on the line.\n\nThe hot and fierce battle opens the door to a new era.\n\n(Source: Official site)",
      "session": null,
      "slug": null,
      "duration": "1 hr 47 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 85,
      "popularity": 3903,
      "favorites": 667,
      "scored_by": 23775,
      "scanned_at": "2025-12-16T02:01:07.287Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "33050",
      "title": "Fate/stay night Movie: Heaven's Feel - III. Spring Song",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.64,
      "poster": "https://cdn.myanimelist.net/images/anime/1142/112957l.webp",
      "synopsis": "The Fifth Holy Grail War in Fuyuki City has reached a turning point in which the lives of all participants are threatened as the hidden enemy finally reveals itself. As Shirou Emiya, Rin Toosaka, and Illyasviel von Einzbern discover the true, corruptive nature of the shadow that has been rampaging throughout the city, they realize just how dire the situation is. In order to protect their beloved ones, the group must hold their own against the seemingly insurmountable enemy force—even if some of those foes were once their allies, or perhaps, something more intimate.\n\nAs the final act of this chaotic war commences, the ideals Shirou believes will soon be challenged by an excruciating dilemma: is it really possible to save a world where everything seems to have gone wrong?\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 2 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 86,
      "popularity": 667,
      "favorites": 8412,
      "scored_by": 214660,
      "scanned_at": "2025-12-16T02:01:08.248Z",
      "source": "jikan"
    },
    {
      "id": 803,
      "malid": "4565",
      "title": "Gurren Lagann",
      "type": "TV",
      "episodes": 27,
      "status": "Finished Airing",
      "season": "Spring",
      "year": 2007,
      "score": 8.64,
      "poster": "https://i.animepahe.si/uploads/posters/7c5a987dfc789eeda000e95e798a9241e4fc3b2099f1dd2b738abb02ca760416.jpg",
      "synopsis": "Humans have enjoyed their lavish, peaceful, and prosperous lives for seven years since the day the almighty Spiral King was defeated—the day they reclaimed their homeland, Earth. However, the boon of this lifestyle leaves them unprepared when an unknown, hostile threat arises due to the ever-growing human population. This calamity is the Anti-Spiral—a fearsome enemy with unparalleled power. \n \nAs the Spiral King's prognosis postulating the destruction of \"The Spiral's World\" begins to come true, the pieces are in place, and Team Dai-Gurren is ready. With his late brother's hope to see a better future for mankind, Simon—along with Nia Teppelin and the rest of the team—is determined to overthrow the mighty Anti-Spiral in order to revive humanity's lost hope.\n\n[Written by MAL Rewrite]",
      "session": "fb8fa223-6fe1-0df1-1a03-87ea7fdaa307",
      "slug": null,
      "duration": "2 hr 5 min",
      "rating": "R+ - Mild Nudity",
      "rank": 107,
      "popularity": 1173,
      "favorites": 1176,
      "scored_by": 110660,
      "scanned_at": "2025-12-16T02:01:10.042Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "58125",
      "title": "Look Back",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.63,
      "poster": "https://cdn.myanimelist.net/images/anime/1716/142633l.webp",
      "synopsis": "Ayumu Fujino may only be in the fourth grade, but she already basks in high praise for her hand-drawn four-panel comics featured in the school's newspaper. However, when she is asked to share the page with Kyoumoto—a reclusive student she has never met—Fujino feels inadequate for the first time: her free-spirited drawings look embarrassingly amateurish next to Kyoumoto's breathtakingly detailed art.\n\nFor a year, Fujino shuts out the world, obsessively studying manga creation and drawing tirelessly to catch up to her faceless competition. But Kyoumoto's talent far exceeds hers, and Fujino quits it all. Another year passes, and on the day of their graduation, Fujino finally meets Kyoumoto. This unkempt, shy, and stuttering girl has actually been Fujino's biggest fan all along. Their encounter reignites Fujino's passion for art and sparks the beginning of a years-long friendship built on rivalry, admiration, and their shared love of manga.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "57 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 88,
      "popularity": 1289,
      "favorites": 4266,
      "scored_by": 117378,
      "scanned_at": "2025-12-16T02:01:08.807Z",
      "source": "jikan"
    },
    {
      "id": 2218,
      "malid": "36862",
      "title": "Made in Abyss",
      "type": "TV",
      "episodes": 13,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 2017,
      "score": 8.63,
      "poster": "https://i.animepahe.si/posters/5ba952c94081c0074da1c12ff8f11d1989bbdc9c97907d28fa94ea0f09bd8b5f.jpg",
      "synopsis": "After bonding over a tragic loss, the long-suffering Nanachi joins Riko and Reg on their journey into the depths of the Abyss. Awaiting the children is the Sea of Corpses—the Abyss's fifth layer, and the deepest level from which a traveler can return without losing their human form.\n\nThe masked sadist Bondrewd stands between the children and the rest of their adventure. Bondrewd's horrific laboratory serves as a final checkpoint for those wishing to traverse deeper into the Abyss, and the sociopathic scientist has no desire to allow Riko's party to pass through at no cost. Deeply scarred by Bondrewd's impact on their childhood, Nanachi is engulfed in turmoil over his resurgence in their life.\n\nBondrewd's only apparent weakness is Prushka, a brash child who claims to be his daughter. Riko, Reg, and Nanachi befriend Prushka and work with the girl to overcome her father's machinations and breach the Abyss's sixth layer.\n\n[Written by MAL Rewrite]",
      "session": "f6b8065d-5ff7-f30a-78ad-a9b4f094a047",
      "slug": null,
      "duration": "1 hr 45 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 107,
      "popularity": 471,
      "favorites": 3916,
      "scored_by": 295922,
      "scanned_at": "2025-12-16T02:01:10.314Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "52742",
      "title": "Haikyuu!! Movie: Gomisuteba no Kessen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.61,
      "poster": "https://cdn.myanimelist.net/images/anime/1665/140360l.webp",
      "synopsis": "Kenma Kozume has never considered volleyball fun or thrilling: it is merely something he is good at. But now Nekoma High School's volleyball team has qualified for the Spring Nationals and prepares to battle their long-standing rivals—Karasuno. Now, Kenma has to analyze the most confounding and resilient team and lead Nekoma to victory against them. Moreover, he will play against his friend Shouyou Hinata, Karasuno's short but incredibly proficient middle blocker.\n\nKarasuno has never been able to beat Nekoma in practice matches. Even so, despite his usual indifference, Kenma feels a tinge of excitement at the prospect of facing Karasuno in a high-stakes official game with no do-overs. To advance to the semifinals and ultimately restore their team's former glory, Karasuno must find a way to overcome Kenma's brilliant strategy and defeat Nekoma in their own territory.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 24 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 100,
      "popularity": 1298,
      "favorites": 1653,
      "scored_by": 95798,
      "scanned_at": "2025-12-16T02:01:09.767Z",
      "source": "jikan"
    },
    {
      "id": 3602,
      "malid": "38329",
      "title": "Rascal Does Not Dream of a Dreaming Girl",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 2019,
      "score": 8.59,
      "poster": "https://i.animepahe.si/posters/f7b254611ae134a88623e1e52b62b9fcd78473a7a60c21ebd391e642f019ac34.jpg",
      "synopsis": "Six months ago, Sakuta Azusagawa had a chance encounter with a bunny girl in a library. Ever since then, he's been blissfully happy with his girlfriend: Mai Sakurajima, that same bunny girl. However, the reappearance of his mysterious first crush, the now-adult Shouko Makinohara, adds a new complication to his relationship with Mai. To make matters worse, he then encounters a middle school Shouko in the hospital, suffering from a grave illness. Mysteriously, his old scars begin throbbing whenever he's near her.\n\nWith Shouko's bizarre situation somehow revolving around him, Sakuta will need to come to terms with his own conflicting feelings, for better or worse. With a girl's life in his hands, just what can he do?\n\n[Written by MAL Rewrite]",
      "session": "8b71d4f7-84aa-46c5-73f0-d0311ae9615d",
      "slug": null,
      "duration": "1 hr 30 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 110,
      "popularity": 274,
      "favorites": 11050,
      "scored_by": 505656,
      "scanned_at": "2025-12-16T02:01:10.807Z",
      "source": "animepahe"
    },
    {
      "id": 644,
      "malid": "7311",
      "title": "The Disappearance of Haruhi Suzumiya",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Winter",
      "year": 2010,
      "score": 8.59,
      "poster": "https://i.animepahe.si/posters/fb1eb93ec98ea10755e7c03e6fa615a97be71d469e495fee118713a6d08347cc.jpg",
      "synopsis": "On a cold December day, Kyon arrives at school prepared for another outing with his fellow SOS Brigade members. However, much to his surprise, he discovers that almost everything has changed completely: Haruhi Suzumiya and Itsuki Koizumi are nowhere to be found; Mikuru Asahina does not recognize him at all; Yuki Nagato is a regular human; and Ryouko Asakura has mysteriously returned. Although he is no stranger to the supernatural, Kyon is disturbed by this odd turn of events and decides to investigate on his own.\n\nFinding himself to be the only person that is aware of the previous reality, Kyon is now faced with a difficult choice: to finally live the normal life he has always wanted, or uncover a way to turn back the hands of time and restore his chaotic yet familiar world.\n\n[Written by MAL Rewrite]",
      "session": "441d4a56-6524-376f-1639-908e2562aa2c",
      "slug": null,
      "duration": "2 hr 41 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 110,
      "popularity": 375,
      "favorites": 14057,
      "scored_by": 325429,
      "scanned_at": "2025-12-16T02:01:11.302Z",
      "source": "animepahe"
    },
    {
      "id": 4490,
      "malid": "3786",
      "title": "Evangelion: 3.0+1.0 Thrice Upon a Time",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Spring",
      "year": 2021,
      "score": 8.58,
      "poster": "https://i.animepahe.si/posters/8ea119fbbd2737e74f7f8e7a7937563cb2a888a0f29ff473d51467d6a06fcbc1.jpg",
      "synopsis": "Following NERV's failed attempt to retrieve the Spears of Longinus and carry out the Human Instrumentality Project, the destruction caused by the Fourth Impact has been largely averted. In a state of disarray, Shinji Ikari, Asuka Langley Shikinami, and Rei Ayanami travel to Village 3—a survivor settlement free from Earth's ruination. There, Shinji slowly comes to terms with his past, developing an entirely different life from his days as an Evangelion pilot.\n\nMeanwhile, NERV makes preparations to continue the Instrumentality Project by means of a new Impact. When WILLE's main aerial battleship arrives at the village, Shinji decides to board, believing that he can help by piloting an Evangelion. As new secrets are uncovered and a battle between WILLE and NERV approaches, the future of Earth hangs in the balance. Can Shinji save humanity and the rest of the world one last time?\n\n[Written by MAL Rewrite]",
      "session": "48fe2bea-2635-b8ef-fdc8-28f58e397fe3",
      "slug": null,
      "duration": "2 hr 35 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 112,
      "popularity": 629,
      "favorites": 8147,
      "scored_by": 186235,
      "scanned_at": "2025-12-16T02:01:11.797Z",
      "source": "animepahe"
    },
    {
      "id": 627,
      "malid": "28957",
      "title": "Mushishi Zoku Shou: Suzu no Shizuku",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Spring",
      "year": 2015,
      "score": 8.58,
      "poster": "https://i.animepahe.si/posters/4294936913d71176554688580e85f278dde304213ea36952d4d7af43b75a7a0a.jpg",
      "synopsis": "On a warm summer day, a boy heard the sound of bells ringing, as if in celebration, in the mountain near his home. Several years later in that same mountain, the mushishi Ginko encounters a strange girl with weeds growing out of her body. Soon after, Ginko coincidentally runs into the now grown-up boy Yoshiro on his way off the mountain. With Yoshiro's help, Ginko soon begins to uncover who this mysterious girl is and what happened to her.\n\nAn adaptation of the last arc in the manga, Mushishi Zoku Shou: Suzu no Shizuku follows Ginko's peculiar journey amidst the occult to unravel the mystery behind the enigmatic girl called Kaya and the mountain that has become her home.\n\n[Written by MAL Rewrite]",
      "session": "a8170146-e632-2fc4-a917-e1eb4ce347ab",
      "slug": null,
      "duration": "47 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 114,
      "popularity": 1835,
      "favorites": 235,
      "scored_by": 55263,
      "scanned_at": "2025-12-16T02:01:12.073Z",
      "source": "animepahe"
    },
    {
      "id": 1578,
      "malid": "32",
      "title": "Neon Genesis Evangelion: The End of Evangelion",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 1997,
      "score": 8.56,
      "poster": "https://i.animepahe.si/posters/7d2a4ad1cc9de70b7817394068d307c582bfc40c843925efe55c759d7aec7544.jpg",
      "synopsis": "Shinji Ikari is left emotionally comatose after the death of a dear friend. With his son mentally unable to pilot the humanoid robot Evangelion Unit-01, Gendou Ikari's NERV races against the shadow organization SEELE to see who can enact their ultimate plan first. SEELE desires to create a godlike being by fusing their own souls into an Evangelion unit, while Gendou wishes to revert all of humanity into one primordial being so that he can be reunited with Yui, his deceased wife.\n\nSEELE unleashes its military forces in a lethal invasion of NERV headquarters. As SEELE's forces cut down NERV's scientists and security personnel, Asuka Langley Souryuu pilots Evangelion Unit-02 in a desperate last stand against SEELE's heaviest weaponry.\n\nThe battle rages on, and a depressed Shinji hides deep within NERV's headquarters. With the fate of the world resting in Shinji's hands, Captain Misato Katsuragi hunts for the teenage boy as society crumbles around them.\n\n[Written by MAL Rewrite]",
      "session": "14199f36-beac-e539-7d55-811b7a49fc10",
      "slug": null,
      "duration": "1 hr 26 min",
      "rating": "R+ - Mild Nudity",
      "rank": 119,
      "popularity": 178,
      "favorites": 31621,
      "scored_by": 679036,
      "scanned_at": "2025-12-16T02:01:14.774Z",
      "source": "animepahe"
    },
    {
      "id": 2250,
      "malid": "31757",
      "title": "Kizumonogatari Part 2: Hot-Blooded",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 2016,
      "score": 8.56,
      "poster": "https://i.animepahe.si/posters/d85479464efaa32c15dfd73cc7610c86b9692d1dd6414be6aa5ce6c66d021932.jpg",
      "synopsis": "No longer truly human, Koyomi Araragi decides to retrieve Kiss-shot Acerola-orion Heart-under-blade's severed body parts that were stolen by three powerful vampire hunters. Awaiting him are Dramaturgie, a vampire hunter who is a vampire himself; Episode, a half-vampire with the ability to transform into mist; and Guillotinecutter, a human priest who is the most dangerous of them all.\n\nUnbeknownst to Araragi, each minute he spends trying to retrieve Kiss-shot's limbs makes him less of a human and more of a vampire. Will he be able to keep his wish of becoming human once again by the end of his battles?\n\n[Written by MAL Rewrite]",
      "session": "f1ffe99a-3a1b-5094-3cbe-c7c4d8d8c725",
      "slug": null,
      "duration": "1 hr 8 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 121,
      "popularity": 527,
      "favorites": 2453,
      "scored_by": 291166,
      "scanned_at": "2025-12-16T02:01:12.562Z",
      "source": "animepahe"
    },
    {
      "id": 1139,
      "malid": "12355",
      "title": "Wolf Children",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Summer",
      "year": 2012,
      "score": 8.56,
      "poster": "https://i.animepahe.si/uploads/posters/57d9dfca445652782ffa68ccecbc9115b8a5d1acc457de0a5be239772cc5f494.jpg",
      "synopsis": "Hana, a hard-working college student, falls in love with a mysterious man who attends one of her classes though he is not an actual student. As it turns out, he is not truly human either. On a full moon night, he transforms, revealing that he is the last werewolf alive. Despite this, Hana's love remains strong, and the two ultimately decide to start a family.\n\nHana gives birth to two healthy children—Ame, born during rainfall, and Yuki, born during snowfall—both possessing the ability to turn into wolves, a trait inherited from their father. All too soon, however, the sudden death of her lover devastates Hana's life, leaving her to raise a peculiar family completely on her own. The stress of raising her wild-natured children in a densely populated city, all while keeping their identity a secret, culminates in a decision to move to the countryside, where she hopes Ame and Yuki can live a life free from the judgments of society. Wolf Children is the heartwarming story about the challenges of being a single mother in an unforgiving modern world.\n\n[Written by MAL Rewrite]",
      "session": "30ee0dce-7cb0-e73b-9bdb-9c05f2c0b79d",
      "slug": null,
      "duration": "1 hr 57 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 124,
      "popularity": 247,
      "favorites": 11800,
      "scored_by": 480835,
      "scanned_at": "2025-12-16T02:01:14.277Z",
      "source": "animepahe"
    },
    {
      "id": 2906,
      "malid": "36098",
      "title": "I Want To Eat Your Pancreas",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Fall",
      "year": 2018,
      "score": 8.55,
      "poster": "https://i.animepahe.si/posters/59fbf88616eeccec4de35cce02eb8d54723abe93dc7a37244407dab5c3bc5fc1.jpg",
      "synopsis": "The aloof protagonist: a bookworm who is deeply detached from the world he resides in. He has no interest in others and is firmly convinced that nobody has any interest in him either. His story begins when he stumbles across a handwritten book, titled Living with Dying. He soon identifies it as a secret diary belonging to his popular, bubbly classmate Sakura Yamauchi. She then confides in him about the pancreatic disease she is suffering from and that her time left is finite. Only her family knows about her terminal illness; not even her best friends are aware. Despite this revelation, he shows zero sympathy for her plight, but caught in the waves of Sakura's persistent buoyancy, he eventually concedes to accompanying her for her remaining days.\n\nAs the pair of polar opposites interact, their connection strengthens, interweaving through their choices made with each passing day. Her apparent nonchalance and unpredictability disrupts the protagonist's impassive flow of life, gradually opening his heart as he discovers and embraces the true meaning of living.\n\n[Written by MAL Rewrite]",
      "session": "72990c50-e263-1b88-1728-d99aec86642c",
      "slug": null,
      "duration": "1 hr 48 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 126,
      "popularity": 160,
      "favorites": 22815,
      "scored_by": 648252,
      "scanned_at": "2025-12-16T02:01:15.268Z",
      "source": "animepahe"
    },
    {
      "id": 2144,
      "malid": "437",
      "title": "Perfect Blue",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Winter",
      "year": 1998,
      "score": 8.55,
      "poster": "https://i.animepahe.si/uploads/posters/afe5d9602052a2ac51926fa2f25eac5979b7012e0e038aa35ea9d1520678acdd.jpg",
      "synopsis": "J-pop idol group CHAM! has spent the last two years entertaining its fans. Sadly, all good things must come to an end, and CHAM! must see one of its members, Mima Kirigoe, leave the group to pursue her acting career. While Mima's choice is met with a mixed response, she hopes her fans will continue to support her.\n\nHowever, Mima's life begins to change drastically after her departure from the group. Wanting to shed her pop-idol image, she takes on a role in a crime drama series, and her career as an actress gradually becomes more demanding and taxing for both Mima and her manager, Rumi Hidaka. To add to Mima's growing unease, an obsessed fan who is incapable of accepting that Mima has quit being an innocent idol, begins stalking her; a new anonymous website begins to impersonate her life with intricate detail; and CHAM! also appears to be doing better without her. One by one, each disturbing development drives Mima to become increasingly unhinged and unable to distinguish reality from fantasy.\n\n[Written by MAL Rewrite]",
      "session": "a4203716-ad5e-e852-da1e-1e4b03eab8d0",
      "slug": null,
      "duration": "1 hr 21 min",
      "rating": "R+ - Mild Nudity",
      "rank": 127,
      "popularity": 277,
      "favorites": 21411,
      "scored_by": 428768,
      "scanned_at": "2025-12-16T02:01:15.541Z",
      "source": "animepahe"
    },
    {
      "id": 4381,
      "malid": "40456",
      "title": "Demon Slayer: Kimetsu no Yaiba - The Movie: Mugen Train",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": "Fall",
      "year": 2020,
      "score": 8.55,
      "poster": "https://i.animepahe.si/uploads/posters/46cffab71bb5d9c26289282fbf1dcc1a5a9ad945fc40c72cfb1d058d725ac8bb.jpg",
      "synopsis": "After a string of mysterious disappearances begin to plague a train, the Demon Slayer Corps' multiple attempts to remedy the problem prove fruitless. To prevent further casualties, the Flame Pillar, Kyoujurou Rengoku, takes it upon himself to eliminate the threat. Accompanying him are some of the Corps' most promising new blood: Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira, who all hope to witness the fiery feats of this model demon slayer firsthand.\n\nUnbeknownst to them, the demonic forces responsible for the disappearances have already put their sinister plan in motion. Under this demonic presence, the group must muster every ounce of their willpower and draw their swords to save all two hundred passengers onboard. As things begin to spiral out of control, Tanjirou's resolve and commitment to duty are put to the test.\n\n[Written by MAL Rewrite]",
      "session": "ea2c3898-522f-eb0a-0aa7-1c3b02109256",
      "slug": null,
      "duration": "1 hr 56 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 130,
      "popularity": 68,
      "favorites": 13491,
      "scored_by": 1150279,
      "scanned_at": "2025-12-16T02:01:16.038Z",
      "source": "animepahe"
    },
    {
      "id": null,
      "malid": "578",
      "title": "Hotaru no Haka",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.54,
      "poster": "https://cdn.myanimelist.net/images/anime/1485/141208l.webp",
      "synopsis": "As World War II reaches its conclusion in 1945, Japan faces widespread destruction in the form of American bombings, devastating city after city. Hotaru no Haka, also known as Grave of the Fireflies, is the story of Seita and his sister Setsuko, two Japanese children whose lives are ravaged by the brutal war. They have lost their mother, their father, their home, and the prospect of a bright future—all tragic consequences of the war.\n\nNow orphaned and homeless, Seita and Setsuko have no choice but to drift across the countryside, beset by starvation and disease. Met with the apathy of adults along the way, they find that desperate circumstances can turn even the kindest of people cruel yet their youthful hope shines brightly in the face of unrelenting hardship, preventing the siblings from swiftly succumbing to an inevitable fate.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 28 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 134,
      "popularity": 299,
      "favorites": 8980,
      "scored_by": 448091,
      "scanned_at": "2025-12-16T02:01:17.017Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "7472",
      "title": "Gintama Movie 1: Shinyaku Benizakura-hen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.52,
      "poster": "https://cdn.myanimelist.net/images/anime/4/28803l.webp",
      "synopsis": "Gintoki and his Yorozuya friends (or rather, employees suffering under labor violations), Shinpachi and Kagura, continue to scrape by in the futuristic, alien-infested city of Edo. They take on whatever work they can find while trying not to get involved in anything too dangerous. But when Katsura, the leader of the Joui rebels and Gintoki's long-time acquaintance, disappears after being brutally attacked by an unknown assassin, Shinpachi and Kagura begin an investigation into his whereabouts and the identity of the assailant. Meanwhile, Gintoki takes on a seemingly unrelated job: the blacksmith Tetsuya requests that Gin recover a strange and powerful sword called the Benizakura which was recently stolen.\n\nAs the two investigations gradually intersect, the Yorozuya crew find themselves in the midst of a major conspiracy that hinges on the sinister nature of the Benizakura sword. Gintoki resolves to take the fight directly to the enemy headquarters, and together with a few unexpected allies, sets out on one of his most perilous jobs yet.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 35 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 143,
      "popularity": 1534,
      "favorites": 632,
      "scored_by": 100935,
      "scanned_at": "2025-12-16T02:01:18.379Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "4282",
      "title": "Kara no Kyoukai Movie 5: Mujun Rasen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.51,
      "poster": "https://cdn.myanimelist.net/images/anime/4/75851l.webp",
      "synopsis": "In November 1998, a double homicide occurs at the newly constructed Ogawa apartment complex in the heart of Mifune City. The murderer, Tomoe Enjou, has fled in a panic. To his astonishment, he is not pursued by the police and news of the incident has not been reported through media outlets. After Shiki Ryougi defends Tomoe from a group of thugs, she allows him to use her residence as a hideout. However, a few days later, Tomoe is shaken to discover that his mother is alive, even though he is convinced that he killed her.\n \nCoincidentally, Mikiya Kokutou is investigating a tip that his associate Touko Aozaki receives regarding the murder at the unique apartment complex. As he uncovers more information about the incident, Mikiya takes a particular interest in Tomoe. Deciding to investigate him further, Mikiya soon discovers the disturbing truth of the foreboding Ogawa complex.\n\nThe fifth installment of the Kara no Kyoukai film series, Mujun Rasen combines an intricately constructed mystery with established themes and characters to produce a dark, thought-provoking story.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 54 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 147,
      "popularity": 1089,
      "favorites": 4685,
      "scored_by": 138166,
      "scanned_at": "2025-12-16T02:01:20.504Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "60544",
      "title": "Nezha Zhi Mo Tong Nao Hai",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.51,
      "poster": "https://cdn.myanimelist.net/images/anime/1616/147002l.webp",
      "synopsis": "After the heavenly lightning, although Ne Zha and Ao Bing survived by becoming Spirits, they would soon dissipate completely. Taiyi plans to rebuild Ne Zha and Ao Bing's mortal bodies with the Seven-colored Precious Lotus. However, during the process of reconstruction, numerous obstacles arise. What will become of the fate of Ne Zha and Ao Bing? \n\n(Source: AMC)",
      "session": null,
      "slug": null,
      "duration": "2 hr 23 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 149,
      "popularity": 7561,
      "favorites": 56,
      "scored_by": 3742,
      "scanned_at": "2025-12-16T02:01:19.137Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "11981",
      "title": "Mahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.5,
      "poster": "https://cdn.myanimelist.net/images/anime/5/54231l.webp",
      "synopsis": "The young girls of Mitakihara happily live their lives, occasionally fighting off evil, but otherwise going about their peaceful, everyday routines. However, Homura Akemi feels that something is wrong with this unusually pleasant atmosphere—though the others remain oblivious, she can't help but suspect that there is more to what is going on than meets the eye: someone who should not exist is currently present to join in on their activities.\n\nMahou Shoujo Madoka★Magica Movie 3: Hangyaku no Monogatari follows Homura in her struggle to uncover the painful truth behind the mysterious circumstances, as she selfishly and desperately fights for the sake of her undying love in this despair-ridden conclusion to the story of five magical girls.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 56 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 153,
      "popularity": 635,
      "favorites": 9557,
      "scored_by": 244493,
      "scanned_at": "2025-12-16T02:01:21.670Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "40664",
      "title": "Shoujo☆Kageki Revue Starlight Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.5,
      "poster": "https://cdn.myanimelist.net/images/anime/1378/119190l.webp",
      "synopsis": "With the arrival of a new generation of talented girls, another lively year at Seishou Music Academy begins. The graduating 99th class is already preparing for the much-anticipated rendition of Starlight, a bittersweet story about the parting of two girls.\n\nIt seems like all students in the Actor Training Department have their post-graduation future figured out—except for the cheerful Karen Aijou. Having fulfilled her promise of performing in a play with Hikari Kagura, her ambitious childhood friend, Karen struggles to find her purpose. What lies beyond their promise is a mystery to Karen, as Hikari was the fuel that kept her passion for performing aflame. Now alone, Karen must confront the reality of stage girls and find her way toward the future—her very own stage.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 154,
      "popularity": 4892,
      "favorites": 1028,
      "scored_by": 10847,
      "scanned_at": "2025-12-16T02:01:22.430Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "33049",
      "title": "Fate/stay night Movie: Heaven's Feel - II. Lost Butterfly",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.46,
      "poster": "https://cdn.myanimelist.net/images/anime/1974/98158l.webp",
      "synopsis": "The Fifth Holy Grail War continues, and the ensuing chaos results in higher stakes for all participants. Shirou Emiya continues to participate in the war, aspiring to be a hero of justice who saves everyone. He sets out in search of the truth behind a mysterious dark shadow and its murder spree, determined to defeat it.\n\nMeanwhile, Shinji Matou sets his own plans into motion, threatening Shirou through his sister Sakura Matou. Shirou and Rin Toosaka battle Shinji, hoping to relieve Sakura from the abuses of her brother. But the ugly truth of the Matou siblings begins to surface, and many dark secrets are exposed.\n\nFate/stay night Movie: Heaven's Feel - II. Lost Butterfly continues to focus on the remaining Masters and Servants as they fight each other in the hopes of obtaining the Holy Grail. However, as darkness arises within Fuyuki City, even the state of their sacred war could be in danger.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 57 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 172,
      "popularity": 608,
      "favorites": 3558,
      "scored_by": 252970,
      "scanned_at": "2025-12-16T02:01:24.518Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "58222",
      "title": "Given Movie 3: Umi e",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.46,
      "poster": "https://cdn.myanimelist.net/images/anime/1663/144261l.webp",
      "synopsis": "Second part of Given Movie: Hiiragi Mix.",
      "session": null,
      "slug": null,
      "duration": "1 hr 20 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 174,
      "popularity": 4796,
      "favorites": 135,
      "scored_by": 7478,
      "scanned_at": "2025-12-16T02:01:23.187Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "11577",
      "title": "Steins;Gate Movie: Fuka Ryouiki no Déjà vu",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.45,
      "poster": "https://cdn.myanimelist.net/images/anime/1611/112806l.webp",
      "synopsis": "After a year in America, Kurisu Makise returns to Akihabara and reunites with Rintarou Okabe. However, their reunion is cut short when Okabe begins to experience recurring flashes of other timelines as the consequences of his time traveling start to manifest. These side effects eventually culminate in Okabe suddenly vanishing from the world, and only the startled Kurisu has any memory of his existence.\n\nIn the midst of despair, Kurisu is faced with a truly arduous choice that will test both her duty as a scientist and her loyalty as a friend: follow Okabe's advice and stay away from traveling through time to avoid the potential consequences it may have on the world lines, or ignore it to rescue the person that she cherishes most. Regardless of her decision, the path she chooses is one that will affect the past, the present, and the future.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 30 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 181,
      "popularity": 382,
      "favorites": 2800,
      "scored_by": 376998,
      "scanned_at": "2025-12-16T02:01:25.476Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "21899",
      "title": "Gintama: Yorinuki Gintama-san on Theater 2D",
      "type": "Movie",
      "episodes": 2,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.42,
      "poster": "https://cdn.myanimelist.net/images/anime/1172/90571l.webp",
      "synopsis": "Demonic Vice-Commander of the Shinsengumi, Toushirou Hijikata, acquires a cursed sword—one which completely rewrites his personality, morphing him from a hard-boiled, no-nonsense cop into a hopeless otaku. As he struggles to break the curse, an ambitious new member of the police force, Itou Kamotarou, seizes the opportunity to depose Hijikata in his bid for power within the organization. However, Itou's scheme is revealed to be more devious than anyone imagined, and the very existence of the Shinsengumi is thrown into peril.\n\nIn another time and place, the Yorozuya squad is suddenly greeted by a potential new recruit. Before them is a mysterious young woman named Pirako Doromizu who hides a penchant for extreme violence behind her smiling, enthusiastic exterior. However, unbeknownst to Gintoki and the others, Pirako has strong ties to one of the ruling figures of the Kabuki district of Edo, and her arrival sets off a chain reaction that throws the inhabitants of the district into a civil war.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 36 min per ep",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 195,
      "popularity": 3566,
      "favorites": 44,
      "scored_by": 18114,
      "scanned_at": "2025-12-16T02:01:28.003Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "36538",
      "title": "Natsume Yuujinchou Movie: Utsusemi ni Musubu",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.42,
      "poster": "https://cdn.myanimelist.net/images/anime/1250/94846l.webp",
      "synopsis": "Takashi Natsume and his spirit companion Madara, nicknamed \"Nyanko,\" continue returning the names of spirits from the Book of Friends given by his late grandmother Reiko Natsume.\n\nOn his way back from school one day, Takashi encounters a lurking spirit named Monmonbou, who recalls memories of Takashi's grandmother after hearing his name. Takashi's natural curiosity leads him to explore a mysterious town where his grandmother used to live. Befriending her old acquaintance Yorie Tsumura and Yorie's son Mukuo, Takashi unveils more of his grandmother's past.\n\nIn the meantime, Nyanko detours for food and stumbles upon a suspicious \"Spirit Seed,\" which miraculously sprouts into a fruit tree overnight. Giving in to temptation, Nyanko consumes the fruit, splitting him into three. Seeking a solution to Nyanko's predicament, Takashi and his friends lend a hand, unexpectedly uncovering more secrets the town holds in the process.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 44 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 200,
      "popularity": 2631,
      "favorites": 226,
      "scored_by": 30175,
      "scanned_at": "2025-12-16T02:01:26.640Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "39741",
      "title": "Violet Evergarden Gaiden: Eien to Jidou Shuki Ningyou",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.42,
      "poster": "https://cdn.myanimelist.net/images/anime/1667/112943l.webp",
      "synopsis": "Isabella, the daughter of the noble York family, is enrolled in an all-girls academy to be groomed into a dame worthy of nobility. However, she has given up on her future, seeing the prestigious school as nothing more than a prison from the outside world. Her family notices her struggling in her lessons and decides to hire Violet Evergarden to personally tutor her under the guise of a handmaiden. \n\nAt first, Isabella treats Violet coldly. Violet seems to be able to do everything perfectly, leading Isabella to assume that she was born with a silver spoon. After some time together, Isabella begins to realize that Violet has had her own struggles and starts to open up to her. Isabella soon reveals that she has lost contact with her beloved younger sister, Taylor Bartlett, whom she yearns to see again. \n\nHaving experienced the power of words through her past clientele, Violet asks if Isabella wishes to write a letter to Taylor. Will Violet be able to help Isabella convey her feelings to her long-lost sister?\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 31 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 205,
      "popularity": 536,
      "favorites": 1707,
      "scored_by": 276671,
      "scanned_at": "2025-12-16T02:01:28.963Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "36885",
      "title": "Saenai Heroine no Sodatekata Fine",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.41,
      "poster": "https://cdn.myanimelist.net/images/anime/1671/111411l.webp",
      "synopsis": "With the second Winter Comiket just around the corner, Blessing Software has been vigorously producing its new game, \"How to Raise a Boring Girlfriend.\" Despite Utaha Kasumigaoka and Eriri Spencer Sawamura leaving the circle, Megumi Katou and Tomoya Aki are hopeful that, by sticking to Tomoya's original vision for the game, their upcoming creation will exceed Blessing Software's previous installment.\n\nWith the addition of new members Iori and Izumi Hashima, development ensues—but not without its share of setbacks. Things rarely go as planned in the dating sim industry, with numerous obstacles forcing Tomoya to decide between helping his friends or completing the game. \n\nSaenai Heroine no Sodatekata Fine draws the series to a close as Tomoya selects his final route, both within his personal life and Blessing Software.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 54 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 207,
      "popularity": 1348,
      "favorites": 2749,
      "scored_by": 92622,
      "scanned_at": "2025-12-16T02:01:32.247Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "49722",
      "title": "Karakai Jouzu no Takagi-san Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.41,
      "poster": "https://cdn.myanimelist.net/images/anime/1376/123398l.webp",
      "synopsis": "Takagi and Nishikata's final summer in junior high is about to begin, and it's already off to a heartwarming start! When the pair find an abandoned kitten, they decide to work together and take care of their adorable new companion until they can locate its missing mother.\n\n(Source: Sentai Filmworks)",
      "session": null,
      "slug": null,
      "duration": "1 hr 13 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 210,
      "popularity": 2462,
      "favorites": 763,
      "scored_by": 41758,
      "scanned_at": "2025-12-16T02:01:31.084Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "38040",
      "title": "Kono Subarashii Sekai ni Shukufuku wo! Movie: Kurenai Densetsu",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.41,
      "poster": "https://cdn.myanimelist.net/images/anime/1638/119321l.webp",
      "synopsis": "It is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic.\n\nWhen Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang.\n\nThere, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 30 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 211,
      "popularity": 241,
      "favorites": 5015,
      "scored_by": 548135,
      "scanned_at": "2025-12-16T02:01:33.411Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "61952",
      "title": "Luo Xiaohei Zhanji 2",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.41,
      "poster": "https://cdn.myanimelist.net/images/anime/1288/151853l.webp",
      "synopsis": "When an attack shatters the fragile peace between the spirit world and humanity, Hei teams up with Luye, the last disciple of his Shifu Wuxian, to expose a conspiracy that threatens both realms—and the bond they’ve sworn to protect.\n\n(Source: GKIDS)",
      "session": null,
      "slug": null,
      "duration": "1 hr 58 min",
      "rating": "G - All Ages",
      "rank": 212,
      "popularity": 9326,
      "favorites": 32,
      "scored_by": 742,
      "scanned_at": "2025-12-16T02:01:30.327Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "48561",
      "title": "Jujutsu Kaisen 0 Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.39,
      "poster": "https://cdn.myanimelist.net/images/anime/1121/119044l.webp",
      "synopsis": "Violent misfortunes frequently occur around 16-year-old Yuuta Okkotsu, a timid victim of high school bullying. Yuuta is saddled with a monstrous curse, a power that dishes out brutal revenge against his bullies. Rika Orimoto, Yuuta's curse, is a shadow from his tragic childhood and a potentially lethal threat to anyone who dares wrong him.\n\nYuuta's unique situation catches the attention of Satoru Gojou, a powerful sorcerer who teaches at Tokyo Prefectural Jujutsu High School. Gojou sees immense potential in Yuuta, and he hopes to help the boy channel his deadly burden into a force for good. Yet Yuuta struggles to find his place among his talented classmates: the selectively mute Toge Inumaki, weapons expert Maki Zenin, and Panda.\n\nYuuta clumsily utilizes Rika on missions with the other first-year students, but the grisly aftermath of Rika's tremendous displays of power draws the interest of the calculating curse user Suguru Getou. As Getou strives to claim Rika's strength and use it to eliminate all non-jujutsu users from the world, Yuuta fights alongside his friends to stop the genocidal plot.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 44 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 218,
      "popularity": 138,
      "favorites": 10979,
      "scored_by": 737700,
      "scanned_at": "2025-12-16T02:01:36.899Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "4921",
      "title": "Ramayana: The Legend of Prince Rama",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.39,
      "poster": "https://cdn.myanimelist.net/images/anime/1070/104671l.webp",
      "synopsis": "Rama, the eldest prince of the Kingdom of Ayodhya, is beloved by all and the natural successor to his father's throne. However, when one of his father's wives conspires to get her son on the throne instead, Rama ends up being banished into the woods for 14 years. Accompanied by his wife, Sita, and his brother, Lakshman—Rama tries to make the most of life in exile despite his challenges.\n\nThe trio's life in the forest is interrupted, however, when Demon King Ravan sets his sights on Sita. Using a crafty plan, he manages to distract Rama and steal Sita away to his castle. Heartbroken and distraught, Rama searches every corner of the world for his wife, unaware of the lengths he will have to go to rescue her.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 15 min",
      "rating": "G - All Ages",
      "rank": 221,
      "popularity": 6024,
      "favorites": 227,
      "scored_by": 7013,
      "scanned_at": "2025-12-16T02:01:35.736Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "35851",
      "title": "Sayonara no Asa ni Yakusoku no Hana wo Kazarou",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.39,
      "poster": "https://cdn.myanimelist.net/images/anime/11/89556l.webp",
      "synopsis": "Maquia is a member of a special race called the Iorph—mystical beings who can live for hundreds of years and remain separate from the lives and daily troubles of mankind. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.\n\nOne day however, the outside world finds her, as the power-hungry kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality of the Iorph to his bloodline.\n\nThe humans and their Renato ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato that has gone berserk. It soon dies, and she is left deserted in a forest far from home, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her, or how to live with the smoldering loneliness inside, she is determined to make it all work somehow.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 54 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 222,
      "popularity": 522,
      "favorites": 8338,
      "scored_by": 212017,
      "scanned_at": "2025-12-16T02:01:34.572Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "38475",
      "title": "Yuru Camp△ Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/1806/124396l.webp",
      "synopsis": "As time marches forward, Rin Shima, Nadeshiko Kagamihara, and their friends have grown into full-fledged adults. Now with careers and responsibilities, they can no longer freely spend their days camping and adventuring. However, Chiaki Oogaki, who currently works for the Yamanashi Tourism Organization, reunites the group as she comes up with an exciting proposal—to build a campground together to revitalize an abandoned patch of land from their homeplace, the Yamanashi Prefecture.\n\nMotivated by this ambitious project, the girls combine their efforts to create an environment where future generations can enjoy unique moments as they once did, all while reminiscing the charms of camping from their high school days.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 226,
      "popularity": 2453,
      "favorites": 469,
      "scored_by": 33982,
      "scanned_at": "2025-12-16T02:01:43.396Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "40787",
      "title": "Josee to Tora to Sakana-tachi",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/1714/108892l.webp",
      "synopsis": "Equipped with his passion for diving and admiration for marine biology, university student Tsuneo Suzukawa tries his best to juggle several part-time jobs to earn enough money to study abroad. But one night, in a fateful accident, he meets a girl in a wheelchair, driving his current path into a detour.\n\nThe girl, Kumiko—who prefers to be called \"Josee\"—initially comes off as rude. Tsuneo, however, is then convinced by Josee's grandmother to take on the paid job to be Josee's caretaker. Despite being annoyed with her bossy demeanor, Tsuneo sees the opportunity to save more funds to support his academic dream. Nonetheless, after putting up with Josee's behavior for some time, Tsuneo tries to quit, only to discover Josee's dreams of traversing the outside world—to experience a life free from her crippling condition.\n\nChanging his mind, Tsuneo decides to accompany Josee in exploring the wonders that the world has to offer. Through their time together, the two begin to realize that the traits that bind them may be vital toward fulfilling their respective aspirations.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 38 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 227,
      "popularity": 488,
      "favorites": 7006,
      "scored_by": 264412,
      "scanned_at": "2025-12-16T02:01:40.720Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "37515",
      "title": "Made in Abyss Movie 2: Hourou Suru Tasogare",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/1336/95168l.webp",
      "synopsis": "The movie is a compilation of episodes 9-13 of the 2017 television series. Riko and Reg descend to the third layer where Riko has her first experience of the Curse. They descend to the fourth layer where Riko's arm is injured by an Orbed Piercer and Reg tries to save her. Nanachi comes to their aid and saves Riko's poisoned arm. In return Nanachi asks Reg to kill her immortal companion Mitty. Nanachi then joins Riko and Reg in their quest to reach the bottom of the Abyss.\n\n(Source: Wikipedia)",
      "session": null,
      "slug": null,
      "duration": "1 hr 45 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 229,
      "popularity": 1643,
      "favorites": 290,
      "scored_by": 66972,
      "scanned_at": "2025-12-16T02:01:37.859Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "11979",
      "title": "Mahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/6/42265l.webp",
      "synopsis": "Though Sayaka Miki's wish was fulfilled, the unforeseen consequences that came with it overwhelm her, causing her soul gem to become tainted as she succumbs to despair and eventually loses her humanity. Homura Akemi reveals to Kyouko Sakura and Madoka Kaname the ultimate fate of magical girls: once their soul gem becomes tainted, it transforms into a Grief Seed, and they are reborn as witches—a truth Homura learned only through repeating history countless times in a bid to prevent Madoka's tragedy.\n\nKyuubey only compounds their despair when he confesses his true intentions: to harness the energy created from magical girls and use it to prolong the life of the universe. As the threat of Walpurgisnacht, a powerful witch, looms overhead, Homura once again vows to protect Madoka and the world from a grim fate.  \n\nCaught between honoring Homura's wish and saving the world, which one will Madoka choose in the end?\nMahou Shoujo Madoka★Magica Movie 2: Eien no Monogatari is a story of inescapable destiny, and an unlikely hero who could change it all.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 51 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 231,
      "popularity": 1256,
      "favorites": 1101,
      "scored_by": 106718,
      "scanned_at": "2025-12-16T02:01:39.962Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "50183",
      "title": "Blue Giant",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/1958/132159l.webp",
      "synopsis": "Ever since a fateful encounter with jazz music, Dai Miyamoto has dreamed of becoming the world's best jazz saxophonist. After only three years of playing the instrument, he makes the bold decision to move to Tokyo in order to break into the music scene.\n\nWhen he meets pianist Yukinori Sawabe at a small music club, Dai believes that he has found a kindred spirit he can form a band with. However, the classically trained Yukinori is reluctant to accept someone who makes such bold claims with so little experience under his belt. Yet, when he hears Dai's undeniable skill, Yukinori is forced to accept the offer.\n\nAlong with the even less experienced Shunji Tamada, the trio form JASS, a group with a unique sound that might just be able to shake up the stagnating jazz scene.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 59 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 232,
      "popularity": 3703,
      "favorites": 449,
      "scored_by": 16378,
      "scanned_at": "2025-12-16T02:01:41.477Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "5",
      "title": "Cowboy Bebop: Tengoku no Tobira",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.38,
      "poster": "https://cdn.myanimelist.net/images/anime/1439/93480l.webp",
      "synopsis": "Another day, another bounty—such is the life of the often unlucky crew of the Bebop. However, this routine is interrupted when Faye, who is chasing a fairly worthless target on Mars, witnesses an oil tanker suddenly explode, causing mass hysteria. As casualties mount due to a strange disease spreading through the smoke from the blast, a whopping three hundred million woolong price is placed on the head of the supposed perpetrator.\n\nWith lives at stake and a solution to their money problems in sight, the Bebop crew springs into action. Spike, Jet, Faye, and Edward, followed closely by Ein, split up to pursue different leads across Alba City. Through their individual investigations, they discover a cover-up scheme involving a pharmaceutical company, revealing a plot that reaches much further than the ragtag team of bounty hunters could have realized.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 55 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 233,
      "popularity": 650,
      "favorites": 1755,
      "scored_by": 228781,
      "scanned_at": "2025-12-16T02:01:42.437Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "9617",
      "title": "K-On! Movie",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/5/76233l.webp",
      "synopsis": "Graduation looms for the founding members of the Light Music Club. With only a few precious weeks of school left, the girls decide to make the most of it and plan a trip abroad. Hawaii, New York, Dubai—many destinations are suggested, but after a little help from the club's precious pet turtle, Ton-chan, London is chosen as the host of their next misadventure!\n\nYui Hirasawa, Mio Akiyama, Tsumugi Kotobuki, Ritsu Tainaka, and Azusa Nakano will visit famous landmarks, perform live music for Londoners, and eat all sorts of delicious food, all while stumbling clumsily from place to place. But the fun won't last forever, as heartfelt songs and goodbyes will be made as their high school days together come to a close. One thing is for certain though: the undeniable friendships these girls have formed is something that will carry on long after the final scene rolls.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 50 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 243,
      "popularity": 763,
      "favorites": 2971,
      "scored_by": 206476,
      "scanned_at": "2025-12-16T02:01:44.559Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "5205",
      "title": "Kara no Kyoukai Movie 7: Satsujin Kousatsu (Go)",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/9/56619l.webp",
      "synopsis": "In February 1999, a string of murders has Shiki Ryougi and Mikiya Kokutou on edge. These crimes share a disturbing resemblance to a similar set of homicides from 1995, when Shiki and Mikiya first met, and awaken a dark, murderous desire that has laid dormant within Shiki's soul ever since then.\n\nWith Shiki under suspicion due to her involvement in the past killings and supposed resemblance to the killer, she and Mikiya set out to find the true perpetrator. In the midst of their separate investigations, Mikiya grows increasingly concerned with Shiki's well-being and hurries to find the one responsible in order to protect Shiki from her own impulses. With the lead he receives from his cousin, police investigator Daisuke Akimi, Mikiya is led into the underbelly of Mifune City, as the salvation of Shiki's soul lies in his determination to prove her innocence once and for all.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "2 hr 1 min",
      "rating": "R+ - Mild Nudity",
      "rank": 244,
      "popularity": 1259,
      "favorites": 2336,
      "scored_by": 117469,
      "scanned_at": "2025-12-16T02:01:46.886Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "572",
      "title": "Kaze no Tani no Nausicaä",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/10/75914l.webp",
      "synopsis": "A millennium has passed since the catastrophic nuclear war named the \"Seven Days of Fire,\" which destroyed nearly all life on Earth. Humanity now lives in a constant struggle against the treacherous jungle that has evolved in response to the destruction caused by mankind. Filled with poisonous spores and enormous insects, the jungle spreads rapidly across the Earth and threatens to swallow the remnants of the human race.\n\nAway from the jungle exists a peaceful farming kingdom known as the \"Valley of the Wind,\" whose placement by the sea frees it from the spread of the jungle's deadly toxins. The Valley's charismatic young princess, Nausicaä, finds her tranquil kingdom disturbed when an airship from the kingdom of Tolmekia crashes violently in the Valley. After Nausicaä and the citizens of the Valley find a sinister pulsating object in the wreckage, the Valley is suddenly invaded by the Tolmekian military, who intend to revive a dangerous weapon from the Seven Days of Fire. Now Nausicaä must fight to stop the Tolmekians from plunging the Earth into a cataclysm which humanity could never survive, while also protecting the Valley from the encroaching forces of the toxic jungle.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 57 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 245,
      "popularity": 645,
      "favorites": 5944,
      "scored_by": 254080,
      "scanned_at": "2025-12-16T02:01:50.374Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "9260",
      "title": "Kizumonogatari I: Tekketsu-hen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/1783/112810l.webp",
      "synopsis": "During Koyomi Araragi's second year at Naoetsu Private High School, he has a chance encounter with Tsubasa Hanekawa, the top honor student in his class. When they strike up a conversation, Hanekawa mentions a shocking rumor: a vampire with beautiful blonde hair and freezing cold eyes has been seen lurking around town.\n\nHappy to have made a new friend, Araragi writes off the rumor and goes about the rest of his evening in a carefree manner. However, on his way home, he stumbles across splatters of blood leading down the stairs to the subway. His curiosity pushes him to investigate further, so he follows the gruesome pools into the depths of the station. \n\nWhen he arrives at the source of the blood, he is terrified by what he sees—the rumored blonde vampire herself, completely dismembered. After she calls for his help, Araragi must make a decision, one which carries the potential to change his life forever.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 3 min",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 246,
      "popularity": 432,
      "favorites": 3900,
      "scored_by": 307008,
      "scanned_at": "2025-12-16T02:01:47.845Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "49310",
      "title": "Fruits Basket: Prelude",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/1034/120096l.webp",
      "synopsis": "Despite Kyouko Honda's tragic death, her vivid memory lives on, providing guidance through times of hardship to her close ones. However, Kyouko was not always the wise and radiant person that she is fondly remembered as in the present day.\n\nFeeling deserted by her own family and rejected by society, a young Kyouko abandons stability for a life of delinquency, jeopardizing her education and future. Fortunately, her descent into despair is interrupted by a fateful encounter with her husband-to-be Katsuya, who has recently started his teaching internship at her school. \n\nWith a composure surprisingly unaffected by Kyouko's tantrums, Katsuya quickly wins her over through his gentleness and attention toward her—sincere gestures that she has never received before. As the two grow closer together, Kyouko opens her tormented heart to him and, along with it, a door to new horizons.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 28 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 249,
      "popularity": 1977,
      "favorites": 872,
      "scored_by": 48426,
      "scanned_at": "2025-12-16T02:01:49.014Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "39167",
      "title": "Girls & Panzer: Saishuushou Part 4",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.36,
      "poster": "https://cdn.myanimelist.net/images/anime/1652/138188l.webp",
      "synopsis": "The Winter Continuous Track Cup semifinals are underway and Ooarai Girls’ Academy find themselves in deep trouble early in their match against Continuation High School. The Anglerfish Team are knocked out by Continuation's sharpshooter, forcing the rest of the team to use a different game plan. Stepping up in the absence of her star teammates, Azusa Sawa shows her leadership potential by temporarily taking over as Ooarai's commander. However, the match proves that it will take more than a new strategy for Ooarai to survive this time around.\n\nOn the other side of the tournament, Kuromorimine Girls' Academy and St. Gloriana Girls' College are locked in a fiery desert battle. Having developed her own unorthodox tactical style, Erika Itsumi rallies Kuromorimine from the brink of defeat into a fierce showdown against their opponent's veteran commander, Darjeeling. But St. Gloriana have bolstered their ranks with a familiar face who recently transferred to their school, hampering Kuromorimine's quest for victory.\n\nThe championship round is within striking distance for these four schools, but only two will have what it takes to move on!\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "54 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 250,
      "popularity": 4929,
      "favorites": 124,
      "scored_by": 8251,
      "scanned_at": "2025-12-16T02:01:45.519Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "53540",
      "title": "Meitantei Conan Movie 26: Kurogane no Submarine",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.34,
      "poster": "https://cdn.myanimelist.net/images/anime/1138/133101l.webp",
      "synopsis": "This time's location is set in the sea near the Hachijo-jima island, Tokyo. Engineers from around the world have gathered for the full-scale operation of \"Pacific Buoy,\" an offshore facility to connect security cameras owned by the worldwide police forces. A test of a certain \"new technology\" based on a face recognition system is underway there.\n\nMeanwhile, Conan and the Detective Boys visit Hachijo-jima at Sonoko's invitation and receive a phone call from Subaru Okiya informing them that a Europol employee was murdered in Germany by the Black Organization's Jin.\n\nConan, who is disquieted, sneaks into the facility and finds that a female engineer has been kidnapped by the Black Organization...! Furthermore, a USB drive containing certain information in her possession ends up in the hands of the organization... A black shadow also creeps up on Ai Haibara ...\n\n(Source: Crunchyroll, edited)",
      "session": null,
      "slug": null,
      "duration": "1 hr 49 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 270,
      "popularity": 5581,
      "favorites": 119,
      "scored_by": 8950,
      "scanned_at": "2025-12-16T02:01:51.129Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "10534",
      "title": "Doraemon Movie 31: Shin Nobita to Tetsujin Heidan - Habatake Tenshi-tachi",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.32,
      "poster": "https://cdn.myanimelist.net/images/anime/7/72436l.webp",
      "synopsis": "Jealous of Suneo's new robot toy, Nobita asks Doraemon to build him an even better one. Doraemon initially refuses, until Nobita accidentally discovers pieces of a mysterious robot that falls from the sky. After gathering all the robot parts and assembled them together, the giant robot, Zanda Claus, is soon completed. The duo soon learn that the robot is not a mere toy, but a powerful weapon in the fight against the coming Robot Army that is going to attack Earth and enslave the human inhabitants of it. An invasion is near, as a mysterious girl Riruru (リルル, Alternative spelling: Lilulu, Lillele [Doko Demo Doa Scanlations]) shows up, looking for the robot.\n\n(Source: Wikipedia)",
      "session": null,
      "slug": null,
      "duration": "1 hr 48 min",
      "rating": "PG - Children",
      "rank": 278,
      "popularity": 5217,
      "favorites": 178,
      "scored_by": 13839,
      "scanned_at": "2025-12-16T02:01:52.089Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "42886",
      "title": "Ginga Eiyuu Densetsu: Die Neue These - Gekitotsu",
      "type": "Movie",
      "episodes": 12,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.32,
      "poster": "https://cdn.myanimelist.net/images/anime/1859/118711l.webp",
      "synopsis": "As Yang is ordered to appear before the Free Planet Alliance, he’s shaken by the corruption he discovers. Meanwhile, Marshal Reinhardt uncovers disloyalty under his command as an upstart admiral launches a vicious offensive to retake the Iserlohn Fortress. Struggling to make strides in this never-ending bloody war, these two finally see their true enemy lies not from without—but from within!\n\n(Source: Crunchyroll)",
      "session": null,
      "slug": null,
      "duration": "25 min per ep",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 280,
      "popularity": 4853,
      "favorites": 143,
      "scored_by": 9649,
      "scanned_at": "2025-12-16T02:01:53.450Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "55357",
      "title": "Bocchi the Rock! Movie",
      "type": "Movie",
      "episodes": 2,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.31,
      "poster": "https://cdn.myanimelist.net/images/anime/1256/142261l.webp",
      "synopsis": "Theatrical compilation of Bocchi the Rock!",
      "session": null,
      "slug": null,
      "duration": "1 hr 22 min per ep",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 288,
      "popularity": 2926,
      "favorites": 444,
      "scored_by": 7004,
      "scanned_at": "2025-12-16T02:01:54.405Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "51805",
      "title": "Ginga Eiyuu Densetsu: Die Neue These - Sakubou",
      "type": "Movie",
      "episodes": 12,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.31,
      "poster": "https://cdn.myanimelist.net/images/anime/1700/123762l.webp",
      "synopsis": "After Yang Wen-li successfully captures the Iserlohn Fortress, the Free Planets Alliance grows bolder in its militaristic ambitions. With recent incursions into Galactic Empire territory and the possession of a perfect beachhead, the Alliance is now able to deal significant damage to the Empire. However, Reinhard von Lohengramm has no intention of allowing the Free Planets Alliance to gain a foothold. He is adamant about carrying on his best friend Siegfried Kircheis' dearest wish: to be the one to unite the universe. \n\nAs wide-scale military clashes continue, the opportunist Adrian Rubinsky, Fezzan's ambitious leader, attempts to take advantage of the war to further his personal goals.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "25 min per ep",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 290,
      "popularity": 5564,
      "favorites": 70,
      "scored_by": 7210,
      "scanned_at": "2025-12-16T02:01:55.765Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "40211",
      "title": "Luo Xiaohei Zhanji (Movie)",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.31,
      "poster": "https://cdn.myanimelist.net/images/anime/1583/108598l.webp",
      "synopsis": "Luo Xiaohei is a young monster who normally takes the form of a small black cat. Living freely in the forests, gradual deforestation and human development force him to flee and find a new home. Wandering the city streets, the black cat struggles to survive until he encounters Feng Xi, a fellow monster who takes Xiaohei to an isolated island inhabited by a small group of monsters. Excited to find what he thinks is his new home, Xiaohei lives with the monsters for only a short time before Wuxian, a human Guild Executor, arrives on the island in pursuit of Feng Xi.\n\nFeng Xi and his companions manage to teleport off the island, leaving Xiaohei and Wuxian alone. Though Xiaohei refuses to cooperate with the man who attacked his friends, Wuxian forces the black cat to travel to the Guild along with him. Embarking on an uncertain journey, Xiaohei is exposed to a new perspective on the relations between humans and monsters in a rapidly changing world.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 41 min",
      "rating": "G - All Ages",
      "rank": 293,
      "popularity": 4150,
      "favorites": 458,
      "scored_by": 12155,
      "scanned_at": "2025-12-16T02:01:56.920Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "51440",
      "title": "Sasaki to Miyano Movie: Sotsugyou-hen",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.3,
      "poster": "https://cdn.myanimelist.net/images/anime/1574/128922l.webp",
      "synopsis": "With university entrance exams and graduation drawing close, high school senior Shuumei Sasaki has to start taking his future more seriously. However, Sasaki is increasingly finding it hard to study; all he can think about is his boyfriend and junior, Yoshikazu Miyano. Having only recently made their relationship official, Sasaki cannot help but yearn to hold his boyfriend close. But with Sasaki's graduation on their minds, the couple begins to wonder what lies ahead for them both—especially as a public relationship can garner scrutiny from friends and family.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "51 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 299,
      "popularity": 3233,
      "favorites": 386,
      "scored_by": 20513,
      "scanned_at": "2025-12-16T02:01:57.876Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "3784",
      "title": "Evangelion Movie 2: Ha",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.3,
      "poster": "https://cdn.myanimelist.net/images/anime/5/74983l.webp",
      "synopsis": "When the threat of the Angel menace escalates, mankind's defense force is pushed to its limits, with NERV at the forefront of the struggle. Shinji Ikari and his partner Rei Ayanami are assisted by two new pilots: the fiery Asuka Langley Shikinami and the mysterious Mari Illustrious Makinami.\n\nWith the aid of their mechanized Evangelion units, equipped with weapons perfect for engaging their monstrous opponents, the four young souls fight desperately to protect their loved ones and prevent an impending apocalypse. But when startling secrets are brought to light, will the heroes' greatest challenge prove to be the monsters...or humanity itself?\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 52 min",
      "rating": "R+ - Mild Nudity",
      "rank": 304,
      "popularity": 423,
      "favorites": 3571,
      "scored_by": 358941,
      "scanned_at": "2025-12-16T02:01:59.237Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "1365",
      "title": "Meitantei Conan Movie 06: Baker Street no Bourei",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.29,
      "poster": "https://cdn.myanimelist.net/images/anime/1400/94320l.webp",
      "synopsis": "The latest innovation in virtual reality gaming is set for a private showcase, with the children of Japan's elite given the opportunity to playtest it. Unfortunately, their carefree fun is cut short when a company employee is found murdered, his dying message pointing to a clue hidden within the game's historical setting.\n\nAlong with the Detective Boys and Ran Mouri, Conan Edogawa enters the game to solve this mystery and ensure the perpetrator is caught. But once they load in, an artificial intelligence named Noah's Ark imprisons them and the other children within. To escape and bring the murderer to justice, Conan and company must navigate a simulated 19th-century London and track down the infamous Jack the Ripper—with the lives of 50 innocent children depending on them.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 47 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 312,
      "popularity": 2599,
      "favorites": 286,
      "scored_by": 50245,
      "scanned_at": "2025-12-16T02:02:01.909Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "6675",
      "title": "Redline",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.29,
      "poster": "https://cdn.myanimelist.net/images/anime/12/28553l.webp",
      "synopsis": "Every five years, an exhilarating race called Redline is held, and the universe's most anticipated competition has only one rule: that there are none. Racers are pushed to their absolute limit—a feeling that daredevil driver JP knows all too well. Having just qualified to participate in Redline, he is eager to battle against the other highly skilled drivers, particularly the beautiful rising star and the only other human that qualified, Sonoshee McLaren.\n\nBut this year's Redline may be far more dangerous than usual—it has been announced to take place on the planet Roboworld with its trigger-happy military and criminals who look to turn the race to their own advantage. However, the potential danger doesn't stop the racers; in fact, it only adds to the thrill. Relying solely on his vehicle's speed, JP prepares for the event to come, aiming to take first place in the biggest race of his life.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 42 min",
      "rating": "R+ - Mild Nudity",
      "rank": 313,
      "popularity": 622,
      "favorites": 6140,
      "scored_by": 221601,
      "scanned_at": "2025-12-16T02:02:00.953Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "54870",
      "title": "Seishun Buta Yarou wa Randoseru Girl no Yume wo Minai",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.29,
      "poster": "https://cdn.myanimelist.net/images/anime/1937/138379l.webp",
      "synopsis": "As Sakuta Azusagawa waits for Mai Sakurajima at the beach on her high school graduation day, he encounters a version of Mai from her child acting days. However, when Mai finally arrives, her younger self disappears, leaving him confused. Sakuta spots an unfamiliar scar on his body when he returns home, which confirms his suspicion—he is involved in another case of the inexplicable Puberty Syndrome.\n\nNot long after, Sakuta and his sister, Kaede, receive a call from their father. He tells them that their mother, who had been recently discharged from the hospital, wants to see her daughter once more. Experiencing strange occurrences while visiting his mother with Kaede, Sakuta must find a way to solve the Puberty Syndrome abnormalities.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 14 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 315,
      "popularity": 1604,
      "favorites": 629,
      "scored_by": 69858,
      "scanned_at": "2025-12-16T02:01:59.993Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "759",
      "title": "Tokyo Godfathers",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.28,
      "poster": "https://cdn.myanimelist.net/images/anime/1480/132791l.webp",
      "synopsis": "One Christmas Eve, Hana, Gin, and Miyuki are rummaging for presents through heaps of garbage when they chance upon an abandoned baby in the cold winter night. Appalled at the pitiful sight, Hana's maternal instincts kick in and she insists on finding the baby's biological mother to demand an explanation. Naming the baby Kiyoko—meaning pure child—they begin their search using the possible clues left alongside her: a mysterious key and a single note. However, their plans are soon thrown into disarray as they get caught up in a series of unprecedented events.\n\nTokyo Godfathers follows the journey of the trio as they stick together through thick and thin, hoping to deliver Kiyoko to her true home, and find their very own Christmas miracle.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr 32 min",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 321,
      "popularity": 845,
      "favorites": 2923,
      "scored_by": 160772,
      "scanned_at": "2025-12-16T02:02:03.873Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "36371",
      "title": "Ginga Eiyuu Densetsu: Die Neue These - Seiran 3",
      "type": "Movie",
      "episodes": 4,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.28,
      "poster": "https://cdn.myanimelist.net/images/anime/1782/103917l.webp",
      "synopsis": "At the behest of Admiral Yang Wen-li, defected intelligence officer Commander Baghdash makes an emergency broadcast announcing that the National Salvation Military Council staged a coup under the direction of the Galactic Empire. Despite the lack of physical evidence, this debilitating declaration inspires former Rear Admiral Andrew Lynch to reveal his own role in sowing discord within the Free Planets Alliance. A fatal shootout between Lynch and Admiral Dwight Greenhill acts as the final death knell to the short-lived period of martial rule.\n\nWithin the Galactic Empire, footage of Duke Otto von Braunschweig's nuclear bombing of Westerland results in the dissolution of the Lippstadt League. Marquis Reinhard von Lohengramm's decision to allow the massacre for personal gain creates a rift between him and High Admiral Siegfried Kircheis, souring the taste of their inevitable victory. Now on the cusp of achieving absolute power, Reinhard is embattled by his apparent personal failings and the heavy responsibilities of leadership.\n\nThough the civil wars in both the Alliance and the Empire are coming to a close, neither side can ever regain what is lost. Yang Wen-li and Reinhard von Lohengramm each take bitter solace in the knowledge that just on the other side of the galaxy is a worthy opponent—and a true equal.\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "25 min per ep",
      "rating": "R - 17+ (violence & profanity)",
      "rank": 323,
      "popularity": 4544,
      "favorites": 111,
      "scored_by": 14697,
      "scanned_at": "2025-12-16T02:02:03.088Z",
      "source": "jikan"
    },
    {
      "id": null,
      "malid": "30346",
      "title": "Doukyuusei",
      "type": "Movie",
      "episodes": 1,
      "status": "Finished Airing",
      "season": null,
      "year": null,
      "score": 8.27,
      "poster": "https://cdn.myanimelist.net/images/anime/3/78606l.webp",
      "synopsis": "Hikaru Kusakabe is a normal, carefree boy in a rock band who is always focused on the present. During the summer, his entire class is forced to participate in an upcoming chorus festival. By coincidence, he discovers his classmate Rihito Sajou—known for being an honor student with excellent grades—practicing his singing alone. Sajou just cannot seem to get their class' song right, and Kusakabe, delighted at seeing a new side of his straight-laced classmate, offers to help him prepare for the event.\n\nAlthough their lives and personalities are total opposites, they begin to grow closer as time progresses. But with the pressure of an unknown future, what will become of them and their growing relationship?\n\n[Written by MAL Rewrite]",
      "session": null,
      "slug": null,
      "duration": "1 hr",
      "rating": "PG-13 - Teens 13 or older",
      "rank": 331,
      "popularity": 930,
      "favorites": 6506,
      "scored_by": 155878,
      "scanned_at": "2025-12-16T02:02:04.629Z",
      "source": "jikan"
    }
  ]
}